LONGRID = [
    ["Чебоксары", "Знакомство со школой", ["МАОУ «СОШ №61» г.Чебоксары - самая большая школа республики, в которой в настоящее время в 69 классах обучается 1929 учащихся.", ""], "", "", 0],
    ["Чебоксары", "Знакомство со школой", ["Главная цель школы – создание условий для формирования творческой саморазвивающейся личности, способной к успешной адаптации и самореализации в изменяющемся мире.", ""], "", "", 0],
    ["Чебоксары", "Знакомство со школой", ['С 2004 года школа участвует в международном проекте "Ассоциированные школы ЮНЕСКО".', ""], "", "", 0],
    ["Чебоксары", "Знакомство со школой", ['В 2015 году мы стали партнерской школой НИУ "Высшая школа экономики".', ""], "", "", 0],
    ["Чебоксары", "Знакомство со школой", ['Школа дважды вошла в топ-500 лучших школ России и является единственной общеобразовательной школой Чувашской Республики, вошедшей в число 500 лучших школ страны. ', ""], "", "", 0],
    ["Чебоксары", "Знакомство со школой", ["В 2014, 2015, 2016 и 2017 годах школа была включена в национальный реестр РФ «Ведущие образовательные учреждения».", ""], "", "", 0],
    ["Чебоксары", "Знакомство со школой", ["У СОШ №61 есть множество других достижений, ознакомиться с которыми вы можете на нашем сайте.", ""], "", "", 0],
    ["Чебоксары", "История", ['Первое упоминание о Чебоксарах появляется в русских летописях с 1469 года, но археологи считают, что поселение города зародилось намного раньше. Городок был известен также множеством церквей, а чебоксарские колокола знали в Лондоне и Париже.', ""], "", "", 0],
    ["Чебоксары", "История", ['В 18-19 веках в Чебоксарах упор делался в основном на развитие торговли, а не промышленности. Город становится центром по производству солода, вина. Основные городские улицы являются продолжением дорог на Казань и Москву.После создания Чувашской автономии в 1920 году, город Чебоксары становится столицей. Столичный статус положительно сказался на развитии города. В 1940 году население города Чебоксары насчитывало уже более 40 тысяч человек, в 1958 году – более 100 тысяч человек. На сегодняшний день - 495 810 чел.', ""], "", "", 0],
    ["Чебоксары", "Символика", ['Современный герб города Чебоксары представляет собой серебряный пересечённый щит французской формы, разделённый на главу и основание. В лазоревом поле основания — естественные фигуры «Пять серебряных уток» летящих, конвертом. В червлёном поле главы, отделённом от основания зигзагообразной линией (в чувашской орнаментике — изображение реки — в данном случае реки Волга) три серебряных, стилизованных под чувашский орнамент, силуэта дубов. Внутреннее поле двух крайних дубов червлёное, поле среднего силуэта — лазоревое. На лазоревом поле дуба серебряная цифра «1469» — дата первого летописного упоминания Чебоксар...', ""], "gerb.jpg", "", 0],
    ["Чебоксары", "Национальные костюмы", ['Женский костюм состоит из длинной рубахи, которая украшается вышивкой - кепе и широких штанов. На рубаху надевается фартук, также для красоты добавляют подвески из монет. Незамужние девушки носят конусообразную шапочку с тесьмой - тухья. Замужние женщины - платки и хушпу.', ""], "", "", 0],
    ["Чебоксары", "Национальные костюмы", ['Мужская одежда простая. Рубаха, штаны, сапоги/валенки/лапти, шляпа. Всё это сопровождается вышивкой, которая, по поверью чуваш, помогает от сглаза и притягивает удачу. В прошлом чаще всего при изготовлении одежды использовался лён.', ""], "", "", 0],
    ["Чебоксары", "Национальные костюмы", ['Осенью надевали холщовые, суконные кафтаны или халаты, зимой - суконные штаны и овчинные шубы (керек).  Богатые чуваши к шубам добавляли тулуп из чёрной овчины.', ""], "", "", 0],
    ["Чебоксары", "Архитектура", ['Во время экскурсии мы видели множество зданий, построенных в разные эпохи, начиная с храмов и соборов семнадцатого-восемнадцатого веков и заканчивая знаковыми постройками 21 века.', ""], "", "", 0],
    ["Чебоксары", "Архитектура", ['Мне запомнилось здание кинотеатра «Родина» (по ул. К. Иванова, 9), который являлся первым звуковым кинотеатром в Чебоксарах. Он был открыт в 1933 году, и изначально кинотеатр был построен в стиле конструктивизма и имел форму самолёта. Реконструкция здания произошла в 50-ых годах, а после и в 80-ых, и только после этого оно стало таким, каким мы его можем видеть сегодня. Когда-то кинотеатр «Родина» посещал венгерский писатель Мате Залка.', ""], "", "", 0],
    ["Чебоксары", "Архитектура", ['Также, когда экскурсия проходила через Владимирскую горку, хорошо известную жителям города, нам рассказали о Спасо-Преображенском монастыре, что был основан в 1716-ом году. История строения берёт своё начало с приезда святителя Гурия с Владимирской иконой Божией Матери для благословения места под постройку крепости. На территории монастыря находится сохранившийся и отреставрированный храм Владимирской иконы Божией Матери и две часовни, построенные в наши дни. Архитектура города Чебоксары никого не оставит равнодушным.', ""], "", "", 0],
    ["Чебоксары", "Памятники", ['Монумент Матери-Покровительнице восхищает своим размером - с учетом высоты насыпи возвышается на 57 метров, благодаря чему жители и туристы могут его видеть почти с любой точки залива.', ""], "", "", 0],
    ["Чебоксары", "Памятники", ['Интересна история создания, о которой жители любят рассказывать туристам. Первый образ памятника пришёл во сне к главе Чувашской Республики на тот момент Н. В. Фёдорову. ', ""], "", "", 0],
    ["Чебоксары", "Памятники", ['- Я увидел во сне свою мать, - рассказывал первый президент журналистам. - Она стояла на берегу залива, и мне пришла мысль увековечить память обо всех матерях, о матери Чувашии…', ""], "", "", 0],
    ["Чебоксары", "Памятники", ['Мать-Покровительница раскрывает ладони к городу, тем самым оберегает своих детей и жителей, этот жест отзывается в сердце каждого и напоминает о своей маме! На постаменте высечены слова: «Благословенны дети мои, живущие в мире и любви», и на родном чувашском языке: «Килӗшӳпе юратура пурӑнакан ачамсем пиллӗхлӗ». ', ""], "", "", 0],
    ["Чебоксары", "Памятники", ['Памятник расположен на большом холме западной части набережной залива. Это место особенно пользуется популярностью во время свадеб. Жители приходят туда, чтобы попросить у покровительницы благословение.', ""], "", "", 0],
    ["Чебоксары", "Памятники", ['На улице Калинина расположен памятник, любимому чувашами, советскому лётчику-космонавту Андрияну Николаеву, открытый 5 сентября 2011 года в честь 50-летия первого полета человека в космос. У приезжих туристов этот памятник вызывает интерес и восхищение, а у чувашей - чувство гордости за своего соотечественника.', ""], "", "", 0],
    ["Чебоксары", "Фотозоны", ['Одно из красивейших мест - Залив. На нём вы увидите лучшие памятники и фотозоны. Самым популярным является Памятник Остапу Бендеру и Кисе Воробьянинову - героям романа “Двенадцать стульев”. Скульптурная инсталляция расположена на чебоксарском Арбате (бульвар купца Ефремова). У неё имеется интересная особенность - сев на стул между героями, можно почувствовать себя участником немой сцены.', ""], "", "", 0],
    ["Чебоксары", "Фотозоны", ['Автором этого творения является Владимир Порфирьевич Нагорнов — скульптор и художник-портретист. Именно он в свое время создал монумент Матери-покровительницы.', ""], "", "", 0],
    ["Чебоксары", "Фотозоны", ['Скульптура “Маленький принц” - самое тёплое и душевное место на Заливе. Находится она недалеко от памятника Остапу и Кисе. Люди приходят туда, чтобы почувствовать себя маленьким ребёнком, и запечатлеть этот момент.', ""], "", "", 0],
    ["Чебоксары", "Знаменитости", ['Василий Чапаев. Легендарный комдив, герой первой мировой и гражданской войн.', ""], "", "", 0],
    ["Чебоксары", "Знаменитости", ['Андриян Николаев. Космонавт №3 и военный летчик, наряду с Гагариным и Титовым.', ""], "", "", 0],
    ["Чебоксары", "Знаменитости", ['Анатолий Миттов. Определил новые пути для поисков национального содержания и художественного языка и оказал значительное влияние на духовное развитие многих чувашских художников. Произведения графики, живописи и книжные иллюстрации вошли в золотой фонд чувашского искусства. Значительная их часть находится в собрании Чувашского государственного художественного музея.', ""], "", "", 0],
    ["Чебоксары", "Знаменитости", ['Яковлев Иван Яковлевич. Великий просветитель чувашского народа, составитель первой азбуки на чувашском языке. Именно он создал чувашскую письменность, переняв русскую графику и добавив в нее чувашские буквы.', ""], "", "", 0],
    ["Чебоксары", "Интересные факты", ['Чебоксары — чистый и уютный город. Он много раз признавался самым чистым из российских городов.', ""], "", "", 0],
    ["Чебоксары", "Интересные факты", ['На чувашском языке Чебоксары произносятся, как «Шупашкар».', ""], "", "", 0],
    ["Чебоксары", "Интересные факты", ['День города здесь отмечается каждое третье воскресенье августа.', ""], "", "", 0],
    ["Чебоксары", "Интересные факты", ['В Чебоксарах покоится царская особа из рода Романовых. Мария Шестова в 1601 году была сослана по приказу Бориса Годунова в Никольский женский монастырь Чебоксар. В 1610 году Марию Шестову похоронили в склепе под южным приделом Никольского собора. Старое бревенчатое здание через некоторое время сгорело, на его месте построили новое, каменное, но могила сохранилась.', ""], "", "", 0],
    ["Чебоксары", "Интересные факты", ['5.	В нашем крае тоже когда-то родился свой собственный чувашский Ван Гог по имени Миттов Анатолий Иванович. Его именем названы бульвар в Чебоксарах, школа в родном селе.', ""], "", "", 0],
    ["Чебоксары", "Сувениры", ['«Чебоксары… Чебурек… Чемодан… А Чебурашки нету», – говорил Крокодил Гена в нашем любимом мультфильме. Ну и как после этого Чебоксарам было не наделать сувениров с Чебурашкой?', ""], "", "", 0],
    ["Чебоксары", "Сувениры", ['Глиняные свистульки, матрёшки, фигурки животных, расписанные чувашскими орнаментами, а также салфетки и фартуки с чувашской вышивкой являются самыми покупаемыми сувенирами.', ""], "", "", 0],
    ["Чебоксары", "Сувениры", ['Плетёные изделия из бересты, выполняются из полос косым или прямым плетением. И используются для декорирования обычных бытовых предметов.', ""], "", "", 0],
    ["Чебоксары", "Сувениры", ['В Чувашии очень популярны всевозможные куклы-обереги. Они могут быть тряпичными, соломенными, глиняными…', ""], "", "", 0],
    ["Чебоксары", "Сувениры", ['«Акконд» — российская кондитерская фабрика, одно из крупнейших промышленных предприятий Чувашии. О конфетах «Птица дивная» так много восторженных отзывов, что уехать из Чебоксар без пары коробок в чемодане просто невозможно.', ""], "", "", 0],
    ["Чебоксары", "Национальная кухня", ['Шартан - популярное чувашское блюдо, которое по праву является главным достоянием культуры. Раньше готовился из желудка овцы, мяса и круп, а сейчас - ещё и из печени, сердца с добавлением специй. Настоящий Шартан посылался на фронт воинам.', ""], "", "", 0],
    ["Чебоксары", "Национальная кухня", ['Хуплу - вкусный закрытый пирог круглой формы с картофелем и мясом. Раньше он готовился исключительно в русской печи. На первом этапе снималась верхняя корочка и съедалась сразу, только потом приступали к начинке.', ""], "", "", 0],
    ["Чебоксары", "Национальная кухня", ['Сим-пыл - вино, за основу которого берут мед. В древности состоятельные люди имели в запасе этот напиток.', ""], "", "", 0]
]


from db import DB_new
import pprint
ALL_PARTS = {}
for part in LONGRID:
    # print(part)
    city, header, p, img, link, serial_of_card = part
    header = header.split("!")[-1]
    text, author = ".".join(p[:-1]), p[-1]
    
    if "." not in img:
        if img == "карта":
            img = ""
            type = "map"
        else:
            type = "simple-card"
    if header in ALL_PARTS:
        ALL_PARTS[header]["full_text"].append(text)
        ALL_PARTS[header]["author"] = author if ALL_PARTS[header]["author"] == "" else ""
        if img != "":
            ALL_PARTS[header]["img"].append(img)
        ALL_PARTS[header]["card"] = serial_of_card if ALL_PARTS[header]["card"] == 0 else ALL_PARTS[header]["card"]
    else:
        ALL_PARTS[header] = {
            "full_text" : [text],
            "author" : author,
            "img" : [img] if img != "" else [],
            "type" : type,
            "link" : link,
            "card" : serial_of_card
        }

DBN = DB_new()
# DBN.create_all_tables()
rout = "/cheboxary"
DBN.create_new_article("Чебоксары", rout, "/img/cheboxary-gerb.png", "/img/cheboxary-pre.jpg")
for el in ALL_PARTS:
    if len(ALL_PARTS[el]["img"]) <= 3:
        im_1 = []
        for i in range(len(ALL_PARTS[el]["img"])):
            im_1.append(ALL_PARTS[el]["img"])
        type = "simple-card" if ALL_PARTS[el]["type"] not in ["map"] else ALL_PARTS[el]["type"]
    else:
        im_1 = ALL_PARTS[el]["img"]
        type = "karousel"
    id_longrid = DBN.add_new_longrid_part(rout, el, "", el, ALL_PARTS[el]["full_text"], ALL_PARTS[el]["author"], im_1)
    if ALL_PARTS[el]["card"] != 0:
        if "*" in str(ALL_PARTS[el]["card"]):
            pass
        else:
            id_of_card = ALL_PARTS[el]["card"]
            city, header, p, img, link = STATES[id_of_card - 1]
            text, author = p[:-1], p[-1]
            DBN.add_new_card_to_longrid(id_longrid, header, text, img, "", "text", author)
    elif type == "map":
        DBN.add_new_card_to_longrid(id_longrid, header, text, img, "", "map", author)