LONGRID = [
    ["Казань", "Первое впечатление", ["Наша дружная группа вновь отправилась в экспедицию, чтобы с головой окунуться в проект ЭТНО-хакатон. На этот раз мы прибыли в Казань – столицу Татарстана. Даже из окна автобуса видно, что город чистый и опрятный, а дороги ровные и широкие." , ""], "", "", 0],
    ["Казань", "Первое впечатление", ["Микрорайон, где мы высадились из автобуса, называется «Седьмое небо». Наверное, потому, что вокруг стоят небоскрёбы. У нас в Чебоксарах дома выше 10 этажей – редкость, в Казани же это необходимо. В городе проживает около миллиона человек." , ""], "", "", 0],
    ["Казань", "Знакомство со школой", ["Центр жилого массива – многопрофильная школа № 181. Нас гостеприимно встречают директор Дина Альбертовна, учителя, дети, одетые в национальные костюмы. Школа уютная, красиво оформленная, глаза разбегаются. Но первое знакомство всё же виртуальное: в актовом зале мы смотрим видео-экскурсию по школе." , ""], "Встреча.jpg", "", 0],
    ["Казань", "Знакомство со школой", ["Через несколько минут мы отправимся по коридорам и мастерским. А пока нас просто захватывает танец «Дружба народов». Мелодии сменяют друг друга, девушки в национальных костюмах народов Поволжья парами выходят вперед и исполняют знакомые движения. Как радостно застучало сердце, когда мы узнали родной чувашский мотив!" , ""], "Танец Др.jpg", "", 0],
    ["Казань", "Знакомство со школой", ["Это выступление оставило прекрасное впечатление и осталось в памяти надолго. Фестиваль народов в школе №181- это уже традиция. Об этом нам поведали ученицы школы на интервью. Нам очень понравилась идея такого праздника, ведь важно понять, что традиции мы несём в себе. Знание о своём крае сближает нас со своим народом." , ""], "Интервью.jpg", "", 2],
    ["Казань", "Знакомство со школой", ["После выступления, на одном из мастер-классов по изготовлению калфаков, преподаватели разговаривали на татарском языке. Очень интересно было слушать татарскую речь, так как она отличается от привычной нам чувашской. Калфак – традиционный женский головной убор в Татарстане, удивительно было узнать, что делается он достаточно легко! Иголка, нитка, ткань, пара стежков и готово!", ""], "калфак.jpg", "", 0],
    ["Казань", "Знакомство со школой", ["Потом мы весело выкладывали собственные имена на русском и английском языках с помощью…матрёшек и тюльпанов. Такая уникальная азбука – ручная работа ребят и педагогов. К ручному труду в казанской школе, как мы заметили, особо трепетное отношение." , ""], "имена.jpg", "", 0],
    ["Казань", "Знакомство со школой", ["Помимо мастер-класса по изготовлению калфаков, нам показали процесс создания деревянных значков с эмблемой школы, и рисования элементов татарских орнаментов. В целом и общем, нас полностью одарили и духовно, и физически, ведь мы унесли на память сделанные собственными руками сувениры." , ""], "ШкилаКЗН.jpg", "", 0],
    ["Казань", "Экскурсия по городу!история", ["Для начала мы узнали пару фактов о Казани и ее символике: Казань расположена на левом берегу реки Волги, при впадении в неё реки Казанки, в 820 км к востоку от Москвы. Благодаря выгодному географическому расположению, Казань издавна была торговым посредником между Востоком и Западом." , ""], "", "", 0],
    ["Казань", "Экскурсия по городу!история", ["Согласно официальной версии, принятой в настоящее время, город был основан более 1000 лет назад. Предполагаемая дата возникновения городского поселения на месте Казани — 1004—1005 годы." , ""], "Первые зарисовки.jpg", "", 0],
    ["Казань", "Экскурсия по городу!история", ["Первое письменное упоминание о городе встречается в Рогожском летописце: «В лето 6899 (1391 г.)…Того же лета новгородци Новагорода Великаго да и устьюжане гражане и прочии к тому совокупившеся выидоша в насаедах и в ушкуех рекою Вяткою на низ и взяша Жукотин, и пограбиша весь, и Казань, и пакы выидоша на Волгу и пограбиша все всех, и тако поидоша прочь»." , ""], "", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["Символом Казани является мифическое существо Зилант, часто упоминаемое в легендах.  По традициям геральдики, дракон символизирует мощь, мудрость и непобедимость, земля — жизнь и богатство, корона — развитость, а шапка над щитом — столичность города." , ""], "Зилан.jpg", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["А какие легенды связаны с этим «Зилантом»? Например, есть история о том, когда многочисленные змеи и рептилии сильно мешали развитию города, охотники отправились на поиски Царя змей и победили его.", ""], "", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["Фонтан «Казан» в парке Тысячелетия", ""], "Чаша.jpg", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["Другая легенда утверждает, что гигантский драконоподобный змей всегда сторожил ханские сокровища, и что он и по сей день охраняет спрятанные перед захватом города богатства в потаённых пещерах. Исторически достоверно, что змеи некогда были многочисленны в казанском регионе, но затем число их резко сократилось. ", ""], "Чаша.jpg", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["Фрагмент печати Ивана Грозного", ""], "Печать.jpg", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["А вот символом Татарстана как целого региона, конечно, являются флаг и герб. Первой идет полоса зелёного цвета, она означает весеннею зелень, возрождение и молодость. Также, зеленый - цвет Ислама. В середине проходит тонкая полоска белого цвета, она символизирует чистоту, честь и мир. Последней частью флага является широкая полоса красного цвета, выражая зрелость, силу и жизненную энергию народа.", ""], "флагТТ.jpg", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["На гербе изображён крылатый барс на фоне красного солнца, он помещен в обрамление из татарского народного орнамента, который расшифровывается как “Татарстан”. Барс - покровитель народа, круглый щит - правовая, экономическая, силовая защищенность граждан республики.", ""], ".jpg", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["Также, татарский народ имеет свои уникальные орнаменты. Основной его мотив - тюльпан, он несет в себе смысл возрождения и неразрывно связан с религиозными убеждениями мусульманской веры.", ""], "Тюльпан.jpg", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["Нельзя не рассказать о национальной символике и не поговорить о национальном костюме. Основу костюма составляют кулмэк (рубаха-платье) и шаровары, а также бешмет, чекмень и казакин. В качестве верхней одежды часто надевался халат.", ""], "Халат.jpg", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["(Даже сейчас, когда костюм это вещь более сценическая и праздничная) Татары все равно очень трепетно относятся к своему наряду. На формирование современного татарского наряда очень повлияли религия и восточные мотивы.", ""], "", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["По одному очень интересному поверью, считалось, что душа человека уходит через отверстия и дыры в одежде, поэтому татары всегда следили за своей одеждой.", ""], "", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["Также, для циркуляции положительной энергии и близости к природе, татары расшивали свои одеяния спиральками и завитками, это еще был и оберег. Он был не везде, лишь на определенных местах. Плотный узор всегда был около женской груди (именно ей ведь вскармливают детей.)", ""], "Костюмчики.jpg", "", 0],
    ["Казань", "Экскурсия по городу!символика", ["Очень часто использовались украшения из камня, бисера, перьев, шнурков, драгоценных металлов. Такой наряд был удобен и красив, подходил и для выходов в свет, и для повседневной носки, и для исполнения национальных танцев.", ""], "Украшения.jpg", "", 0],
    ["Казань", "Экскурсия по городу!архитектура", ["Экскурсия по городу восхитила по-настоящему. Интересно было узнать историю Казанского кремля, зайти внутрь мечети Кул-шариф, услышать чтение Корана , увидеть наклоненную башню Сююмбике.", ""], "Кууул.jpg", "", 0],
    ["Казань", "Экскурсия по городу!архитектура", ["Конечно, как древнее и очень красивое место, оно обросло легендами. Есть одна, которая объясняет название башни: Иван Грозный, прослышав о красоте Сююмбике, направил в Казань сватов, предложив ей стать его женой и царицей Руси. Сююмбике не хотела покидать родину и отказалась. Тогда разгневанный царь со своим войском подошел к Казани, пообещав стереть город с лица земли. Сююмбике испугалась за свой народ и приняла предложение, попросив у него необычный свадебный подарок — башню.(Ниже сама татарская царица)", ""], "Царица.jpg", "", 0],
    ["Казань", "Экскурсия по городу!архитектура", ["Ничего не оставалось Сююмбике, кроме как согласиться на замужество. Перед свадьбой попросилась она подняться на башню, чтобы осмотреть напоследок любимый город. И поняла, что не может покинуть родину. Сююмбике расплакалась и бросилась вниз. Вот такая трагичная история у такого красивого места", ""], "Башня-Сюю.jpg", "", 0],
    ["Казань", "Экскурсия по городу!архитектура", ["Дальше мы отправились к мечети «Кул-Шариф». Она была открыта 24 июня 2005 года, к 1000-летнему юбилею Казани. Это был один из самых крупных объектов, построенных к празднику. Архитектура здания поражает своей красотой. Её купол, окрашенный в цвет неба, напоминает шапку-корону, которые раньше носили казанские ханы.", ""], "Мечеть.jpg", "", 0],
    ["Казань", "Экскурсия по городу!архитектура", ["Интересным фактом является то, что мечеть имеет 5 этажей, включая цокольный и технический. На первом расположен молельный зал для мужчин и кабинет имама, на втором - молельный зал для женщин и смотровая площадка в виде балконов для туристов. На цокольном расположились гардеробы, музей ислама и зал для омовения.", ""], "Внутри.jpg", "", 0],
    ["Казань", "Экскурсия по городу!архитектура", ["Также стоит отметить, что в Кул-Шариф чтение Корана происходит круглосуточно. Атмосфера в мечети несравнима ни с чем. Замысловатые мозаики, огромные люстры, витражи… Свет так и льется внутрь.", ""], "", "", 0],
    ["Казань", "Экскурсия по городу!архитектура!карта", ["Ближе к вечеру мы поехали гулять по Старо-Татарской слободе. Место ну с очень уж интересной архитектурой. Это одна из исторических частей и комплексных достопримечательностей в центре Казани, в южной части Вахитовского района города.", ""], "карта", "", 0],
    ["Казань", "Экскурсия по городу!архитектура!карта", ["Слобода в целом вытянута с северо-запада на юго-восток и расположена между озером Нижний Кабан и каналом-протоком Булак на востоке.  Осевой для слободы улицей является улица Тукая, но мы шли по улице Каюма Насыри. ", ""], "карта", "", 0],
    ["Казань", "Экскурсия по городу!архитектура", ["Широкая улица, отреставрированные старинные дома, если бы не пара современных многоэтажных домов вдалеке, можно было бы подумать, что мы забрели на съемки исторического фильма.", ""], "Слобода.jpg", "", 1],
    ["Казань", "Экскурсия по городу!архитектура", ["А ведь у каждого дома свои особенности, здесь, в Старо-Татарской слободе жили не малозначимые для Казани люди. Без преувеличения, в этом уникальном ансамбле национальной татарской архитектуры каждый дом связан с выдающимися для татарской истории и культуры именами.", ""], "", "", 0],
    ["Казань", "Экскурсия по городу!архитектура", ["Хоть мы и не заходили на территорию мечети Аль-Марджани, увидеть ее красоту и величественность мы смогли.", ""], "Мечеть 2.jpg", "", 0],
    ["Казань", "Интересные факты", ["• Во всей Восточной Европе лишь Прага и Киев древнее, чем Казань. (даже Москва младше!)", ""], "", "", 0],
    ["Казань", "Интересные факты", ["• Из всех российских городов только Казань полностью самостоятельно перерабатывает все свои отходы.", ""], "", "", 0],
    ["Казань", "Интересные факты", ["• Этот город является одним из самых многонациональных в России, здесь проживают представители более чем 115 национальностей. Больше всего, однако, в Казани русских и татар — их примерно поровну, и на них приходится около 95% всего казанского населения.", ""], "", "", 0],
    ["Казань", "Интересные факты", ["• При впечатляющем размере Казани (425 кв. км.) население тут примерно в десять раз меньше, чем в столице (площадь Москвы в пределах МКАД около 900 кв. км.)", ""], "", "", 0],
    ["Казань", "Интересные факты", ["• Казань вполне официально забрендировала титул «третьей столицы России».", ""], "", "", 0],
]

CARDS = [
    [
        ["Казань", "Национальная кухня", ["Все мы любим вкусно покушать, куда ж без этого? Мы, как соседи, конечно наслышаны о татарской кухне, но вот другим рассказать-то надо.", ""], "", ""],
        ["Казань", "Национальная кухня", ["Абсолютно точно визитной карточкой является чак-чак. Мучное восточное печенье из обжаренных во фритюре кусочков теста, перемешанных с медовым сиропом. Чак-чак привозят как сувенир, даже мы не избежали соблазна привезти домой этот сладкий сувенир.", ""], "Чак.jpg", ""],
        ["Казань", "Национальная кухня", ["У многих народов мира есть блюдо по типу «мясо да тесто», у татар этим блюдом является эчпочмак. Треугольные пирожки с различной начинкой, чаще всего с картошкой и мясом.", ""], "Эчпоч.jpg", ""],
        ["Казань", "Национальная кухня", ["В татарской кухне встречаются различные блюда соседей, шурпа - одно из них. У нас в чувашской кухне есть шӳрпе, суть этого наваристого супа одна и та же, но особенности и причуды различают шурпу и шӳрпе.", ""], "Шурпа.jpg", ""],
        ["Казань", "Национальная кухня", ["Губадья – многослойный сладкий пирог с сухофруктами и рисом, который является обязательным на праздничном столе. Блюдо необычное, сочетает мясо, сладость изюма и питательность теста.", ""], "Губадья.jpeg", ""],
    ],
    [ 
        ["Казань", "Знаменитости", ["Казань и Татарстан породили огромное количество известнейших людей. (От моделей до писателей, актеров и певцов.)", ""], "", ""],
        ["Казань", "Знаменитости", ["Федор Михайлович Шаляпин - знаменитый на весь мир русский бас, камерный и оперный певец. Солировал в Большом и Мариинском театрах, последним некоторое время руководил.", ""], "Шаляпин.jpg", ""],
        ["Казань", "Знаменитости", ["Николай Иванович Лобачевский - родился в 1792 г. в Нижнем Новгороде. Когда мальчику было девять лет, семья переехала в Казань. Математик, один из создателей неевклидовой геометрии, деятель университетского образования и народного просвещения.", ""], "Лобачевский.jpg", ""],
        ["Казань", "Знаменитости", ["Аида Ведищева - советская певица, наиболее известная как исполнительница популярных песен из кинофильмов и мультфильмов. Имя может не знакомое младшему поколению, но услышав «Колыбельную Медведицы» вы сразу узнаете ее голос.", ""], "Аида.jfif", ""],
        ["Казань", "Знаменитости", ["МакSим – российская певица известная по своему альбому «Трудный Возраст» и песням «Знаешь ли ты» и «Ветром стать».", ""], "Максим.jpg", ""],
        ["Казань", "Знаменитости", ["Лев Николаевич Толстой – великий русский писатель, автор романа-эпопеи «Война и Мир», в 1841-1848 годах жил в Казани, в 1844-1847 годах был студентом Казанского университета.", ""], "Лев.jpg", ""],
        ["Казань", "Знаменитости", ["Ирина Шейк – российская супермодель, неоднократно признана одной из самых красивых женщин мира. Имеет татарские корни.", ""], "Шейк.jpg", ""],
    ]
]

STATES = [
    ["Казань", "Озеро Кабан", ["Под конец поездки наша делегация держала путь мимо озера Кабан. Вечерние огни города завораживающей красотой отображались на водной глади озера, и экскурсовод, поддержав атмосферу, поведала нам несколько существующих мнений (легенд) про его название и не только.", "Первое гласит, что когда-то дикие свиньи - кабаны обитали в камышах, растущих по берегам озера. К началу 19 века этих кабанов полностью истребили, но название так и осталось.", "Вторая легенда гласит о булгарском князе Кабанбеке, который спасаясь от преследования среднеазиатского завоевателя Тамерлана, бежал на север из разграбленного и перебитого города Болгар. Проходя через леса и болота, он вышел на берег большого чистого озера, чьи воды оказались лечебными и излечили князя. Так он и остался жить на берегу того озера, где вскоре образовалось поселение.", "Также нам рассказали интересную легенду о сокровищах озера Кабан. По преданию, когда войско Ивана Грозного осаждало город в 1552 году, казанские ханы бросали в воду свои невообразимые богатства , дабы те не достались царю. Сокровища и по сей день вызывают интерес и споры. И чтобы удостовериться в правдивости наличия богатств на дне озера, не раз проводились попытки достать клад, что не удавалось из-за глубокого слоя ила, около 2-3 метров.", "Виды и история озера дополнили бушующие эмоции от поездки в Казань и, я думаю, что надолго запечатлятся в нашей памяти.", "Афанасьева Дарья"], "", ""],
    ["Казань", "О школе", ["Ученицы 11 класса Софья и Алёна поделились своим мнением об учебном заведении. Девочки выделили толерантность и неконфликтность учеников с учителями, в стенах заведения преобладает атмосфера приятного коллектива. Также было выделено комфортное обустройство школы: светлые спортзалы, большие раздевалки с душем. От себя ученицы рассказали необычный факт о татарах: в разговорной речи между собой принято использовать слово 'зачем' вместо 'почему'. Вопросы с заменой слов звучат так: зачем у тебя нет ручки?; зачем сегодня пошёл снег?" , "Михайлова Алиса"], "", ""]
]


from db import DB_new
import pprint
ALL_PARTS = {}
for part in LONGRID:
    city, header, p, img, link, serial_of_card = part
    header = header.split("!")[-1]
    text, author = p
    if "." not in img:
        if img == "карта":
            img = ""
            type = "map"
        else:
            type = "simple-card"
    if header in ALL_PARTS:
        ALL_PARTS[header]["full_text"].append(text)
        ALL_PARTS[header]["author"] = author if ALL_PARTS[header]["author"] == "" else ""
        if img != "":
            ALL_PARTS[header]["img"].append(img)
        ALL_PARTS[header]["card"] = serial_of_card if ALL_PARTS[header]["card"] == 0 else ALL_PARTS[header]["card"]
    else:
        ALL_PARTS[header] = {
            "full_text" : [text],
            "author" : author,
            "img" : [img] if img != "" else [],
            "type" : type,
            "link" : link,
            "card" : serial_of_card
        }

DBN = DB_new()
DBN.create_all_tables()
DBN.create_new_article("Казань", "/kazan")
for el in ALL_PARTS:
    if len(ALL_PARTS[el]["img"]) <= 3:
        im_1 = []
        for i in range(len(ALL_PARTS[el]["img"])):
            im_1.append(ALL_PARTS[el]["img"])
        type = "simple-card" if ALL_PARTS[el]["type"] not in ["map"] else ALL_PARTS[el]["type"]
    else:
        im_1 = ALL_PARTS[el]["img"]
        type = "karousel"
    id_longrid = DBN.add_new_longrid_part("/kazan", el, "", el, ALL_PARTS[el]["full_text"], ALL_PARTS[el]["author"], im_1)
    if ALL_PARTS[el]["card"] != 0:
        if "*" in str(ALL_PARTS[el]["card"]):
            pass
        else:
            id_of_card = ALL_PARTS[el]["card"]
            city, header, p, img, link = STATES[id_of_card - 1]
            text, author = p[:-1], p[-1]
            DBN.add_new_card_to_longrid(id_longrid, header, text, img, "", "text", author)
    elif type == "map":
        DBN.add_new_card_to_longrid(id_longrid, header, text, img, "", "map", author)


# import requests, pprint
# import urllib.parse
# map_elements = [
#     "Казань+ул.Петербургская", "Казань+Церковь+Богоявления", 
#     "Казань+Булак", "Казань+Мосты+Булака", "Казань+Дворец+земледельцев", "Набережная+реки+Казанки", "Казанский+Кремль", 
#     "Национальный+музей+Республики+Татарстан", "Мэрия+Казани", "Спасская+башня+Кремля", "Спасо-Преображенский+монастырь", 
#     "Пушечный+двор", "Казань+Губернаторский+дворец", "Ханов", "мечеть+Кул-Шариф", "башня+Сююмбике", 
#     "Мавзолей+Казанских Ханов"
# ]
# ALL_COORDS = []
# for address in map_elements:
#     adress_2 = urllib.parse.quote_plus(address)
#     req = "https://nominatim.openstreetmap.org/?addressdetails=1&q={}&format=json&limit=1".format(adress_2)
#     print(req)
#     req = requests.get(req).json()
#     print(req)
#     req = req[0]
#     ALL_COORDS.append([req['lat'], req['lon']])
# pprint.pp(ALL_COORDS)