LONGRID = [
    ["Нижний Новгород", "Первое впечатление", ["Нижний Новгород – это город разноцветных многоэтажек. Никакого унылого серого кирпича, а только яркие веселые фасады! Это выглядит приветливо, как в старом добром мультике или в сказке." , ""], "", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["В сентябре мы побывали в Нижегородской Авторской Академической Школе №186. Нас встретили очень радушно и доброжелательно, познакомили с внутренним устройством школы, провели увлекательную экскурсию, в ходе которой показали классы, где обучаются ребята" , ""], "ВстречаНН.jpg", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["Во время перемен в коридорах и классах царит настоящее веселье. В школе нет определённого дресс-кода, и ученики одеты в свободную форму, что создаёт некоторое разнообразие в самовыражении учащихся." , ""], "", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["В глаза сразу бросаются лица счастливых детей. Атмосфера школы пропитана уютом и весельем. Для свободного времяпровождения в коридоре организованы специальные места, где дети могут провести небольшой промежуток времени между уроков. В коридорах расположены небольшие мягкие маты и кубы, из которых можно построить то, что хочешь, тем самым развивая фантазию. Также на стенах коридора отмечена история школы, и у самого входа находятся достижения учеников." , ""], "", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["Разные секции и виды спорта, как скалолазание, также дают школьникам вести активный образ жизни в стенах школы. Для менее активных учеников в школе представлена ещё одна интересная локация – библиотека, которую в любой момент можно посетить." , ""], "", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["В школе есть свой открытый музей, посвящённый ремеслам этого региона, который демонстрирует бережное отношение учеников к своей истории." , ""], "ПромыслыНН.jpg", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["В нижегородской школе № 186 уже три года реализуется проект 'наследие'. Цель проекта - создать виртуальное и реальное пространство для изучения народных промыслов. На третьем этаже школы развернулся музей со стендами, каждый из которых оснащен QR кодом, по которому можно узнать всю информацию об изделиях народных промыслов. Нижний Новгород по достоинству стал называться столицей художественных промыслов России." , ""], "", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["4 года назад состоялся первый проект: из всего города в школу приехали мастера шитья, металлообработки, чеканки монет, ткачества. Ребята участвовали в мастер-классах, и некоторые их работы находятся в музее." , ""], "МастераНН", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["Ученики десятых классов создавали проекты по изучению Нижнего Новгорода. Так одна из учениц Валерия Ждановна создала настольные игры о народных промыслах и о городе Нижний Новгород, которые предлагают новые знания о родине и развивают интеллект. Другая ученица 10 класса создала путеводитель промыслов по городу, по которому можно определить местоположение народных промыслов с указанием времени пути до них. Мария Аксёнова разработала путеводитель по школе на английском языке для приезжих гостей из-за рубежа." , ""], "НаследиеНН.jpg", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["Посмотрев на проекты ребят из Нижнего Новгорода, мы постараемся также ознакомить учеников нашей школы с родным городом, с народом и народными традициями." , ""], "", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["Аня, ученица старшей школы, отметила следующее:" , ""], "", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["«Современный интерьер школы и общая атмосфера учебного заведения добавляют мотивации, мы больше стремимся к знаниям и настраиваемся на нужный лад».", ""], "", "", 0],
    ["Нижний Новгород", "Знакомство со школой", ["Глеб и Даша, ученики 9 класса поделились своим мнением о школе, выделив солидарность среди учителей и обучаемых: «В учебном коллективе всегда присутствует уважение и взаимопомощь, каждый уважает личные границы и мнение друг друга. Солидарность - очень важна в наше время, особенно в стенах учебного учреждения».", ""], "", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !символика", ["Символами Нижнего Новгорода, конечно же, являются его герб и флаг.", ""], "", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !символика", ["Герб города Нижний Новгород представляет собой изображение на четырёхугольном, с закруглёнными нижними углами, заострённом в оконечности геральдическом щите, обрамлённом по бокам и снизу лентой ордена Ленина, а в середине расположился олень, над всем этим красуется золотая корона.", ""], "ГербНН.png", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !символика", ["Как и на Гербе, так и на Флаге изображение красного оленя является символом благородства, чистоты и величия, жизни, мудрости и справедливости.", ""], "ГербНН.png", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !символика", ["Говоря о символах, стоит рассказать и о национальных костюмах. Русский народный костюм сочетает в себе яркие расцветки и множество мелких элементов. В древней Руси девушки носили сорочницу, сарафан и передник. Обязательный элемент одежды-вышивка, чем сложнее, тем лучше мастерица владела рукоделием.", ""], "КостюмыНН.jpg", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !символика", ["В мужской наряд входила сорочка, штаны, грешневик, пояс и лапти. Цветовая гамма костюма включала оттенки белого, красного и синего цветов. Рубахи тоже украшается вышивкой, а основными материалами являются лен и хлопок.", ""], "", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["Рождественская церковь была построена в 1719 году промышленником Григорием Строгановым. После того, как он стал единственным наследником родовых земель, Григорий Дмитриевич получил большое состояние. Он был достаточно богат, чтобы построить такую наикрасивейшую церковь в Нижнем Новгороде.", ""], "РЦНН.jpeg", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["Стиль Рождественской церкви был назван в честь своего создателя «Строгановское барокко». После строительства церкви начали появляться легенды. К сожалению, Григорий Дмитриевич не дождался окончания строительства церкви. Он скончался в 1715 году.", ""], "бароккоНН", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["В 1722 всего лишь через 3 года после окончания строительства, она была закрыта Петром I по приезде в Нижний Новгород. В 1727 церковь снова была открыта для прихожан. Стоит отметить, что церковь неоднократно горела, ее восстановлением занималась супруга Григория Строганова.", ""], "ЦСННН.jpg", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["В советское время было принято решение об уничтожении Строгановской церкви. Но храм был спасён отцом Сергием, собравшим материалы о его истории и архитектуре.", ""], "", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["Стоит уделить отдельное внимание часам, которые висят на церкви, они имеют свою интересную историю. Часы показывали и время, и положение светил. Однажды так случилось, что часы остановились, и никто не мог их починить. Тогда на колокольню забрался мальчик и починил их. Это был Иван Кулибин, великий русский изобретатель.", ""], "ЧасыНН.jpg", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["В ходе экскурсии по Нижнему Новгороду мы посетили Нижегородский Кремль. В 1505 году были построены башни кремля, а в 1515 году кремль был достроен и стал основным форпостом Московского царства. Об этом говорит надпись на брусчатке кремля.", ""], "МузейНН.jpg", "", 1],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["Пройдя дальше, мы увидели памятник князю Юрию Всеволодовичу, причисленному к лику святых, и его наставнику епископу Симону Суздальскому.", ""], "ПамятникЮВНН.jpg", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["Далее мы поехали вдоль кремлёвской стены и перед нами предстала панорама окрестностей города. Здесь можно увидеть великую реку Волгу, многоэтажные дома и церковь Святого пророка Илии.", ""], "ПанорамаНН.jpg", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["Валерий Чкаловстал знаменит своим первым беспосадочным перелётом через северный полюс из Москвы в Америку. В его честь 15 декабря 1940 года был воздвигнут памятник на Верхневолжской набережной.", ""], "ЧкаловНН.jpg", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["Интересно, что изначально на этом месте, которое выбрал сам Чкалов, должен был располагаться памятник Максиму Горькому, но после смерти лётчика в результате неудачного испытания самолёта, И.А.Менделевич выступил автором скульптуры друга. От этого памятника отходит Чкаловская лестница, которая раньше называлась Сталинградская, а позже Волжская, но всё же больше прижилось народное название в честь лётчика.", ""], "", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["Лестница соединяет Верхневолжскую и Нижневолжскую набережные. Главной причиной постройки этой лестницы являлось создание кратчайшего пути из самого сердца старого города к Волге.", ""], "ЛестницаНН.jpg", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["Лестницу строили в течение 5 лет до 1949 года. В постройке участвовали жители Горького и немецкие военнопленные. На строительство лестницы ушло около 8 миллионов рублей, что являлось огромной на то время суммой.", ""], "", "", 0],
    ["Нижний Новгород", "Экскурсия по городу !архитектура", ["В 1985 году в самом низу лестницы был установлен катер 'герой'. Судно, которое участвовало в Гражданской и Отечественной войнах, является финальной частью лестницы.", ""], "ГеройНН.jpg", "", 1],
    ["Нижний Новгород", "Сувениры!Хохломская роспись", ["Зародился этот стиль в XVII веке... не в деревне Хохлома! На самом деле роспись пошла из нескольких деревень: Больших и Малых Безделей, Шабашей, Мокушино, Глибино и Хрящей. Хохлома была крупным местом своза и продажи уже готовых изделий, отсюда и название.", ""], "Хохлома.jpg", "", 0],
    ["Нижний Новгород", "Сувениры!Хохломская роспись", ["Все мы хоть раз видели ложки, тарелки, табуретки и прочие вещи, расписанные в этой технике, но задумывались ли вы, откуда на них этот фирменный золотой блеск? Один из экскурсоводов поведал нам весь технический процесс создания.", ""], "", "", 0],
    ["Нижний Новгород", "Сувениры!Городецкая роспись", ["Менее известная, но не менее красивая!, Зародилась в XIX веке, в Городецком районе Нижегородской области. Берет она начало на городецких прялках, мастера превращали эти обычные ручные прялки в настоящие произведения искусства.", ""], "Городец.jpg", "", 0],
    ["Нижний Новгород", "Сувениры!Борнуковская резьба", ["Мастера по традиции используют объемную резьбу. Вообще, камень из Борнукова продавали и для дворцов царской семьи, но и обычные ремесленники вытворяли различные изделия. Люди, животные, канцелярия, светильники, все было популярно, однако именно анималистическое направление стало традиционным. Лисы, медведи, кошки, собаки, совы, коровы - борнуковские мастера изображали всех, кто был рядом.", ""], "БорнуНН.jpg", "", 0],
    ["Нижний Новгород", "Сувениры!Варнавинская резьба", ["Здесь резьба не по камню, а по кости. Ремесло зародилось ещё в XVIII веке, умельцы украшали рукояти ножей резными узорами,воинами и животными: львами, драконами, птицами. Варнавинскую резьбу возродили в XX веке, открыли школу резьбы, позже организовали фабрику. В 80-х промысел стандартизировали, утвердили мотив, который помог обособить его. Изгибающаяся ветка, похожая на хохломскую - особенность этого стиля резьбы. Сейчас ассортимент изделий с варнавинской резьбой огромен. Можно приобрести ларцы и шкатулки, шахматы, письменные принадлежности, гребни, бусы, броши и заколки, в общем, всё что душа пожелает.", ""], "Варнава.jpg", "", 0],
    ["Нижний Новгород", "Сувениры!Казаковская филигрань (скань)!", ["Филигранный промысел в России ещё с IX века, а в селе Казаково с 1938 года. Сформировался он на основе существовавшего там издавна металлообрабатывающего промысла. К 50-м у казаковской скани появились свои отличительные черты, узоры ажурные, с преобладанием растительных мотивов. Чаще всего, изделия белого цвета, на свету они выглядят как снежинки, или покрытые инеем ветки деревьев.", ""], "скань.jpg", "", 0],
    ["Нижний Новгород", "карта", ["Протяженность дороги 3361м.", ""], "", "", 0],
    ["Нижний Новгород", "Интересные факты", ["Мало кто знает, что канатная дорога в Нижнем Новгороде — это не только туристический аттракцион и городская достопримечательность, но и общественный транспорт. Переправа соединяет Нижний Новгород и Бор уже почти 10 лет.", ""], "канатная.png", "", 0],
    ["Нижний Новгород", "Интересные факты", ["Протяженность дороги 3361м.", ""], "", "", 0],
    ["Нижний Новгород", "Интересные факты", ["До 2012года людям приходилось тратить времени на путь между городами почти в 7 раз больше! Ныне канатная дорога является фаворитом у туристов, и неспроста: она пролегает над Волгой, благодаря чему из кабинки фуникулёра открывается потрясающий живописный вид на реку и два города.", ""], "", "", 2]
]

STATES = [
    ["Нижний Новгород", "Память в ВОВ", ["Войдя в кремль, мы увидили музей военной техники под открытым небом, посвящённый памяти трудовых подвигов горьковчан в годы Великой Отечественной войны. Здесь 8 мая 1975 года была открыта постоянно действующая выставка «Горьковчане — фронту». В годы войны здесь выпускалась разнообразная военная техника. Среди них знаменитый танк Т-34, который являлся основным танком РККА до первой половины 1944 года. Также БМ-13 «Катюша» - массовая советская боевая машина реактивной артиллерии.", "В Нижегородском кремле располагаются интересные исторические здания конца XVII века. Например, по проекту архитектора Я.А.Ананьина и его ученика Б.Растрелли был возведён корпус №92 в 1785 году. Сейчас же здесь расположены Законодательное собрание Нижегородской области, дом советов, офисы Администрации Нижегородской области и т.д. В здании 22 мая 1887 года родился летчик П.Н.Нестеров, который первый совершил форму высшего пилотажа «мертвую петлю» и был автором первого в мире воздушного тарана.", "Павлов Даниил"], "Танк.jpg", ""],
    ["Нижний Новгород", "Знаменитости", ["Алексей Максимович Пешков - драматург, прозаик, номинант на Нобелевскую премию по литературе. Человек, который больше известен народу, как Максим Горький. Опубликовав свой первый рассказ “Макар Чудра”, он подписал его “М. Горький”, позже “М.” стала расшифровываться “Максим”", "Пешков родился 28 марта 1868 года в усадьбе своего деда, которая находилась в Нижнем Новгороде. В наше время на месте усадьбы располагается музей “Домик Каширина”. Данный музей символизирует автобиографическую повесть М.Горького “Детство”. В “Домике Каширина” постарались воспроизвести обстановку дома Василия Васильевича и Акулины Ивановны Кашириных, бабушки и дедушки Алексея, максимально точно.", "Жизнь Алексея, литературная и общественная, тесно связана с его малой родиной - Нижним Новгородом. А жизнь города всё ещё переплетается с его именем. Горький - именно так назывался Нижний Новгород до 1990 года.", "Нам удалось побывать на одной из улиц, о которых писал Горький. “Дома каменные, люди железные в них живут,”- писал оноб Ильинской улице. Раньше на этой улице проживали купцы, их дома выстраивались из камня.", ""], "МГ.jpg", ""]
]

from db import DB_new
import pprint
ALL_PARTS = {}
for part in LONGRID:
    city, header, p, img, link, serial_of_card = part
    header = header.split("!")[-1]
    text, author = p
    
    if "." not in img:
        if img == "карта":
            img = ""
            type = "map"
        else:
            type = "simple-card"
    if header in ALL_PARTS:
        ALL_PARTS[header]["full_text"].append(text)
        ALL_PARTS[header]["author"] = author if ALL_PARTS[header]["author"] == "" else ""
        if img != "":
            ALL_PARTS[header]["img"].append(img)
        ALL_PARTS[header]["card"] = serial_of_card if ALL_PARTS[header]["card"] == 0 else ALL_PARTS[header]["card"]
    else:
        ALL_PARTS[header] = {
            "full_text" : [text],
            "author" : author,
            "img" : [img] if img != "" else [],
            "type" : type,
            "link" : link,
            "card" : serial_of_card
        }

DBN = DB_new()
# DBN.create_all_tables()
rout = "/nizhny"
DBN.create_new_article("Нижний Новгород", rout, "/img/nizhny-gerb.png", "/img/nizhny-pre.jpeg")
for el in ALL_PARTS:
    if len(ALL_PARTS[el]["img"]) <= 3:
        im_1 = []
        for i in range(len(ALL_PARTS[el]["img"])):
            im_1.append(ALL_PARTS[el]["img"])
        type = "simple-card" if ALL_PARTS[el]["type"] not in ["map"] else ALL_PARTS[el]["type"]
    else:
        im_1 = ALL_PARTS[el]["img"]
        type = "karousel"
    id_longrid = DBN.add_new_longrid_part(rout, el, "", el, ALL_PARTS[el]["full_text"], ALL_PARTS[el]["author"], im_1)
    if ALL_PARTS[el]["card"] != 0:
        if "*" in str(ALL_PARTS[el]["card"]):
            pass
        else:
            id_of_card = ALL_PARTS[el]["card"]
            city, header, p, img, link = STATES[id_of_card - 1]
            text, author = p[:-1], p[-1]
            DBN.add_new_card_to_longrid(id_longrid, header, text, img, "", "text", author)
    elif type == "map":
        DBN.add_new_card_to_longrid(id_longrid, header, text, img, "", "map", author)