LONGRID = [
     ["Йошкар-Ола",
     "Мини-зоопарк",
    ["2 декабря команда 61 школы побывала в Йошкар-Оле. Одним из самых интересных мест стал “Медведевский мини-зоопарк им. Г. Г. Гибадуллина”. Зоопарк поистине потряс наших ребят своей насыщенностью. Он часто пополняется новыми обитателями. Большое разнообразие животных порадовало нас. Ламы, пони, дикобраз, волк, лисы, козы,  фазаны, медведь, еноты, павлины- кого только не встретишь там.",
    "Пока ребята рассматривали животных, экскурсовод с удовольствием рассказывала о жизни обитателей зоопарка. Но в сердца нашей команды попали ламы-гуанако (такие ламы являются предками одомашненных лам). Очень милые и пушистые создания. Эти животные наблюдали за нами всё время нашего прибывания. Они часто пытались перепрыгнуть через клетку, но ничего не получалось. ",
    "Интересным фактом является то,что все животные ручные, поэтому некоторых можно  гладить. Они с радостью идут на контакт с людьми. Также за их жизнью тщательно наблюдают ветеринары, из-за чего можно не боятся за здоровье наших маленьких друзей.",
    "Шарова Карина"],
    "animal_and_lama.jpg",
    "",
    0],

    ["Йошкар-Ола",
     "Набережная Брюгге",
    ["Уникальным местом в г. Йошкар-Олаявляется набережная Брюгге. Через, которуюпротекает река Малая Кокшага. Прогуливаясь по ней, мы словно окунулись в сказочный мир, почувствовали себя в другой стране и в другом времени. Мы наслаждались архитектурой, которая нас окружала.",
    "У нас как у туристов возник вопрос, а почему же она получила именно такое необычное название. Эти прекрасные маленькие пряничные домики так сильно заманили нас к себе, что нам и не хотелось уходит оттуда. Ведь дома выполнены с такой тонкостью, каждое окошко, каждый элемент несёт свою историю создания.Не зря, йошкаролинцы называют набережную своей маленькой Венецией.",
    "Интересно то, что в таких необычных сказочных домах находится множество учреждений – министерства, образовательные организации, ведомства и другие. Для нас это было совсем необычно, ведь мы привыкли к высоким серым зданиям.",
    "На набережной так же есть различные памятники известных людей.Первый, увиденный нами памятник, возведен в честь Елизаветы Петровны. Мы сразу же начали вспоминать историю её правления. Пройдя немного дальше нам рассказали ещё о неизвестном для нас памятнике знаменитой пары – актрисыГрейс Келли и принца Монако Ренье III.",
    "Будущим гостям г. Йошкар–Олы,желаю скорейшего посещения красивейшего и прекрасного уголка  архитектуры.",
    "Семенова Настя"],
    "bich.jpg",
    "",
    0],

    ["Йошкар-Ола",
     "Набережная Брюгге",
    ["Идея создания набережной принадлежит президенту Марий Эл Леониду Маркелову. По марийски Йошкар означает красный , красивый . Было решено выстроить набережную Брюгге в стиле северной готике . Этому стилю характерный сомкнутые фасады, декоративный башенки и шпили, скульптуры и арочные оформление окон. Здесь находится административные учреждения, кафе ,музеи и сувенирные лавки.",
    "Одним из самых посещаемых мест является Патриаршая площадь. На ней установлен первый в России памятник основателю марийской и Йошкар-Олинской епархии Алексею второму. На башне этой площади установлены уникальные часы, с 9 утра до 9 вечера каждые три часа там появляются фигурки 12 апостолов и Исуса Христа.",
    "Патриаршую площадь и Воскресенскую набережную разделяет река малая Кокшага. Их соединяют между собой воскресенский мост по нему ходят только пешеходы это любимое место для фотосессии местных жителей и туристов.",
    "Благодаря необычности архитектурных ансамблей центр города  изменил облик",
    "Йошкар-Олы и превратил его в 1 из самых необычных и посещаемых городов Поволжья.",
    "Колесова Яна"],
    "another_bich.jpg",
    "",
    0],

    ["Йошкар-Ола",
     "Площадь Оболенского",
    ["Площадь Оболенского- Ноготкова – это то место, которое необходимо посетить каждому туристу, прибывая в Йошкар-Оле. Наш экскурсовод постарался, чтобы мы добрались до этой достопримечательности к определенному времени, ведь каждый час из необычных марийских часов, расположенных над входом в художественную галерею, выходит ослик, который везёт икону Божией матери Троеручицы, что символизирует приход Богоматери на местную землю. Меня впечатлило данное действие, ведь глубокий смысл о попытке Сербии спасти икону с помощью умного животного во время войны с Турцией в 13 веке имеет доступность и может заинтересовать людей любого возраста. Кроме того, в этом месте можно сделать памятные и красивые фотографии, смотря которые, ты будешь испытывать теплые эмоции от посещения города.",
    "Гуляя по площади, моё внимание также привлекла копия Московской Царь-Пушки и памятник первому воеводе Царевококшайска (старое название Йошкар-Олы) Ивану Оболенскому - Ноготкову, который имеет огромное значение в развитии города. Колоритный всадник — исторический символ столицы республики. Внушительные размеры сооружения и месторасположение не позволяют просто пройти мимо. В такие моменты осознаешь всю важность памятников, ведь они как ни что лучше передают историю места, на котором находятся. ",
    "Далее, мы зашли в национальную художественную галерею, где я смогла увидеть марийские сувениры, многие из которых были ручной работы, что позволило мне ещё больше сблизиться с этой культурой. Тогда я заметила множество сходств народных мотивов и узоров с чувашской вышивкой, но, конечно, были и различия. Это стало для меня интересным открытием, ведь, на самом деле, мы - два соседних народа и наши истории переплетаются друг с другом.",
    "Иванова Мария"],
    "circle.jpg",
    "",
    0],

    ["Йошкар-Ола",
     "Йошкин кот",
    ["В Йошкар-Оле возле Марийского государственного университета находится известная всем жителям скульптура «Йошкин кот». Её установили в июне 2011 года одним из символов города и радует глаз жителей и туристов. Выполнена композиция из бронзы и весит 150 кг. Идеей скульптуры устойчивое выражение «ёшкин кот», созвучное с названием города Йошкар-Ола. Особым символизмом среди жителей является сфотографироваться с котом, потереть ему нос наудачу и загадать желание. Эта традиция началась со студентов, загадывавших удачную сдачу сессии. Посещая этот прекрасный город, обязательно стоит посмотреть этот памятник, и загадать желание вновь вернуться в это место!",
    "Михайлова Алиса"],
    "floppa.jpg",
    "",
    0],

    ["Йошкар-Ола",
     "Йошкина кошка",
    ["Йошкин кот - одна из главных визитных карточек Йошкар-Олы. Эта достопримечательность стала настолько популярной, что появление “Йошкиной кошки” не пришлось долго ждать. Изящная, грациозная и безусловно красивая скульптура смотрит на нас хитрыми глазками, сидя возле своего кавалера-кота, который схватил бегущую маленькую мышку коготком. “Йошкина кошка” стоит на Архангельской площади у кафе “Африка”, и я вам очень рекомендую посетить её.",
    "София"],
    "floppa_but_woman",
    "",
    0],

    ["Йошкар-Ола",
     "Часы “Двенадцать апостолов”",
    ["Поздним вечером наш экскурсовод решил показать нам одно из самых интересных мест всей Йошкар-Олы: часы “Двенадцать апостолов”.",
    "Придя на смотровую площадку, мы с нетерпением ждали, когда же откроются двери тех волшебных часов и выйдут легендарные апостолы Иисуса Христа. И вот... Наступает тот самый момент когда звенят колокола и спустя некоторое время выходят под музыкальным сопровождением Иисус на белом ослике и его ученики. Самым увлекательным было смотреть, что все происходит в движении. Они шевелились. Их действия так завораживают. Меня впечатлила эта композиция и у моих друзей она оставила исключительно положительные эмоции.",
    "Харитонова Саша"],
    "xiaomi_mi_band_6_nfc",
    "",
    0],

    ["Йошкар-Ола",
     "Знакомство со школой",
    ["Группа учеников нанесла визит в школу №29 города Йошкар-Ола.",
    "Встретили гостей из Чувашии превосходным народным танцем учеников двадцать девятой школы. Многие с восхищением наблюдали за движениями танцовщиц, смотря безмерно увлечено, а также обязательно фиксируя все происходящее на видеокамеры и собственные смартфоны. Женский танец динамичен и подвижен! Для него характерны такие движения как подскоки, дроби, вращения. Девушки были одеты в национальные костюмы, которые представляют собой белые рубахи с украшениями из ручной вышивки и нагрудники из бисера. Все это хорошо отображало культуру и традиции их народа. Этот танец достаточно хорошо выражал нам некую схожесть с культурой и народными традициями нашей солнечной Чувашии. Оказывается, что есть между нами что-то общее! ",
    "После завершения столь замечательного просмотра танца, директор двадцать девятой школы – Александр Кузнецов, собрал всех учащихся за общим столом, чтобы обсудить все детали проекта и больше рассказать гостям о своей школе. У ребят была возможность задавать свои интересующие вопросы и общаться не только со своими ровесниками, но и с директором нашей школы. У руководителей и учителей были возможности обсудить сферу образования, внедрение новых платформ обучения в наш проект. Внести свои особенности. Мероприятие оказалось познавательным и увлекательным. Поездка осталась приятным воспоминанием и полезным опытом для каждого школьника."],
    "fonk.jpg",
    "",
    0],

    ["Йошкар-Ола",
     "национальные костюмы ",
    ["Народный костюм марийцев имеет ряд общих черт с костюмом других народов Поволжья. Дошедший до нашего времени костюм поражает красочностью орнамента, он остается одним из ярких примеров художественного наследия народа. Рассмотрим женский костюм:",
    "На костюм надевали набор разных украшений – нагрудных и поясных. Состоит из длинной холщовой рубахи (тувыр), служившей одновременно нательной и верхней одеждой. Платье дополняется нагрудным украшением яга, поясом (ӱштӧ) и передником (ончаласакыш). Верхняя одежда – шовыр, распашной летний из белого домотканого холста кафтан. Особенным своеобразием отличались женские головные уборы. Шымакш представлял собой прямоугольный кусок холста, верхний конец которого сшивался остроконечно. Интересно, что весь головной убор богато украшался вышивкой."],
    "сumuflage.jpg",
    "",
    0],

    ["Йошкар-Ола",
     "карта",
    ["Народный костюм марийцев имеет ряд общих черт с костюмом других народов Поволжья. Дошедший до нашего времени костюм поражает красочностью орнамента, он остается одним из ярких примеров художественного наследия народа. Рассмотрим женский костюм:",
    "На костюм надевали набор разных украшений – нагрудных и поясных. Состоит из длинной холщовой рубахи (тувыр), служившей одновременно нательной и верхней одеждой. Платье дополняется нагрудным украшением яга, поясом (ӱштӧ) и передником (ончаласакыш). Верхняя одежда – шовыр, распашной летний из белого домотканого холста кафтан. Особенным своеобразием отличались женские головные уборы. Шымакш представлял собой прямоугольный кусок холста, верхний конец которого сшивался остроконечно. Интересно, что весь головной убор богато украшался вышивкой."],
    "сumuflage.jpg",
    "",
    0],

    ["Йошкар-Ола",
     "Архитектура",
    ["Уникальным местом в Йошкар-Оле является набережная Брюгге.",
    "По-марийски «Йошкар» означает красный, красивый. Было решено выстроить набережную Брюгге в стиле северной готике. Этому стилю характерный сомкнутые фасады, декоративный башенки и шпили, скульптуры и арочные оформление окон. Здесь находится административные учреждения, кафе, музеи и сувенирные лавки.",
    "Одним из самых посещаемых мест является Патриаршая площадь. На ней установлен первый в России памятник основателю марийской и Йошкар-Олинской епархии Алексею второму. На башне этой площади установлены уникальные часы, с 9 утра до 9 вечера каждые три часа там появляются фигурки 12 апостолов и Иисуса Христа.",
    "Патриаршую площадь и Воскресенскую набережную разделяет река малая Кокшага. Их соединяют между собой Воскресенский мост и по нему передвигаются исключительно пешеходы — это любимое место для фотосессии местных жителей и туристов.",
    "Площадь Оболенского-Ноготкова – это то место, которое необходимо посетить каждому туристу, прибывая в Йошкар-Оле. Наш экскурсовод постарался, чтобы мы добрались до этой достопримечательности к определенному времени, ведь каждый час из необычных марийских часов, расположенных над входом в художественную галерею, выходит ослик, который везёт икону Божией матери Троеручицы, что символизирует приход Богоматери на местную землю. ",
    "Гуляя по площади, наше внимание также привлекла копия Московской Царь-Пушки и памятник первому воеводе Ивану Оболенскому-Ноготкову, который имеет огромное значение в развитии города. ",
    "Колоритный всадник — исторический символ столицы республики. Внушительные размеры сооружения и месторасположение не позволяют просто пройти мимо. В такие моменты осознаешь всю важность памятников, ведь они как ни что лучше передают историю места, на котором находятся. ",
    "Далее, мы зашли в национальную художественную галерею, где я смогла увидеть марийские сувениры, многие из которых были ручной работы, что позволило мне ещё больше сблизиться с этой культурой. ",
    "Тогда я заметила множество сходств народных мотивов и узоров с чувашской вышивкой, но, конечно, были и различия. Это стало для меня интересным открытием, ведь, на самом деле, мы - два соседних народа и наши истории переплетаются друг с другом."],
    "my_house.jpg",
    "",
    0]
]

from db import DB_new
import pprint
ALL_PARTS = {}
for part in LONGRID:
    # print(part)
    city, header, p, img, link, serial_of_card = part
    header = header.split("!")[-1]
    text, author = ".".join(p[:-1]), p[-1]
    
    if "." not in img:
        if img == "карта":
            img = ""
            type = "map"
        else:
            type = "simple-card"
    if header in ALL_PARTS:
        ALL_PARTS[header]["full_text"].append(text)
        ALL_PARTS[header]["author"] = author if ALL_PARTS[header]["author"] == "" else ""
        if img != "":
            ALL_PARTS[header]["img"].append(img)
        ALL_PARTS[header]["card"] = serial_of_card if ALL_PARTS[header]["card"] == 0 else ALL_PARTS[header]["card"]
    else:
        ALL_PARTS[header] = {
            "full_text" : [text],
            "author" : author,
            "img" : [img] if img != "" else [],
            "type" : type,
            "link" : link,
            "card" : serial_of_card
        }

DBN = DB_new()
# DBN.create_all_tables()
rout = "/ola"
DBN.create_new_article("Йошкар-Ола", rout, "/img/ola-gerb.png", "/img/ola-pre.jpg")
for el in ALL_PARTS:
    if len(ALL_PARTS[el]["img"]) <= 3:
        im_1 = []
        for i in range(len(ALL_PARTS[el]["img"])):
            im_1.append(ALL_PARTS[el]["img"])
        type = "simple-card" if ALL_PARTS[el]["type"] not in ["map"] else ALL_PARTS[el]["type"]
    else:
        im_1 = ALL_PARTS[el]["img"]
        type = "karousel"
    id_longrid = DBN.add_new_longrid_part(rout, el, "", el, ALL_PARTS[el]["full_text"], ALL_PARTS[el]["author"], im_1)
    if ALL_PARTS[el]["card"] != 0:
        if "*" in str(ALL_PARTS[el]["card"]):
            pass
        else:
            id_of_card = ALL_PARTS[el]["card"]
            city, header, p, img, link = STATES[id_of_card - 1]
            text, author = p[:-1], p[-1]
            DBN.add_new_card_to_longrid(id_longrid, header, text, img, "", "text", author)
    elif type == "map":
        DBN.add_new_card_to_longrid(id_longrid, header, text, img, "", "map", author)