

card_information = [

    ["Нижний Новгород",
     "29 сентября 2021 года команда чебоксарской 61-ой школы посетила Нижний Новгород. Мы смогли узнать много интересных фактов о Нижнем Новгороде, и о людях, живущих в нём. Алексей Пешков, драматург, прозаик, номинант на Нобелевскую премию по литературе - всё это один человек, который больше известен народу, как Максим Горький.",
     [
         "29 сентября 2021 года команда чебоксарской 61-ой школы посетила Нижний Новгород. Мы смогли узнать много интересных фактов о Нижнем Новгороде, и о людях, живущих в нём.",
         "Алексей Пешков, драматург, прозаик, номинант на Нобелевскую премию по литературе - всё это один человек, который больше известен народу, как Максим Горький. Опубликовав свой первый рассказ “Макар Чудра”, он подписал его “М. Горький”, позже “М.” стала расшифровываться “Максим”.",
         "Пешков родился 28 марта 1868 года в усадьбе своего деда, которая находилась в Нижнем Новгороде. В наше время на месте усадьбы располагается музей “Домик Каширина”. Данный музей символизирует автобиографическую повесть М.Горького “Детство”. В “Домике Каширина” постарались воспроизвести обстановку дома Василия Васильевича и Акулины Ивановны Кашириных, бабушки и дедушки Алексея, максимально точно.",
         "Жизнь Алексея, литературная и общественная, тесно связана с его малой родиной - Нижним Новгородом. А жизнь города всё ещё переплетается с его именем. Горький - именно так назывался Нижний Новгород до 1990 года. Некоторые коренные жители до сих пор называют себя горьковчанами, по привычке. ",
         "Одной из точек в нашем маршрутном листе оказалась улица Ильинская. “Дома каменные, люди железные в них живут,” - писал Максим Горький об этой улице. Изучив нравы нижегородских купцов, драматург начал называть их “люди с каменными сердцами”. Также у купцов были каменные особняки, которые выстраивались в абсолютно разных стилях. Классицизм и модерн - эти стили чаще всего прослеживались в домах того времени.",
         "Шарова Карина"],
     "gorky.jpg", ""],

    ["Нижний Новгород",
     "Мало кто знает, что канатная дорога в Нижнем Новгороде - это не только туристический аттракцион и городская достопримечательность, но и общественный транспорт. Переправа соединяет Нижний Новгород и Бор уже почти 10 лет. Протяженность дороги 3361м.",
     [
         "Мало кто знает, что канатная дорога в Нижнем Новгороде - это не только туристический аттракцион и городская достопримечательность, но и общественный транспорт. Переправа соединяет Нижний Новгород и Бор уже почти 10 лет. ",
         "Протяженность дороги 3361м.",
         "До 2012 года людям приходилось тратить времени на путь между городами почти в 7 раз больше! Ныне канатная дорога является фаворитом у туристов, и неспроста: она пролегает над Волгой, благодаря чему из кабинки фуникулёра открывается потрясающий живописный вид на реку и два города.",
         "София"],
     "kd.jpg", ""],

    ["Нижний Новгород",
     "В ходе экскурсии по Нижнему Новгороду мы приехали к кремлю. Нижний Новгород основал князь Юрий Всеволодович в 1221 году. В 1505 году были построены башни кремля, а в 1515 году кремль был достроен и стал основным форпостом Московского царства.",
     [
         "В ходе экскурсии по Нижнему Новгороду мы приехали к кремлю. Нижний Новгород основал князь Юрий Всеволодович в 1221 году. В 1505 году были построены башни кремля, а в 1515 году кремль был достроен и стал основным форпостом Московского царства. Об этом говорит надпись на брусчатке кремля. Пройдя дальше, мы заметили, что рядом с кремлём находится памятник знаменитому советскому летчику Владимиру Чкалову, который совершил первый беспосадочный перелёт из СССР в США. ",
         "Войдя в кремль, мы видим музей военной техники под открытым небом, посвящённый памяти трудовых подвигов горьковчан в годы Великой Отечественной войны. Здесь 8 мая 1975 года была открыта постоянно действующая выставка «Горьковчане — фронту». В годы войны здесь выпускалась разнообразная военная техника. Среди них знаменитый танк Т-34, который являлся основным танком РККА до первой половины 1944 года. Также БМ-13 «Катюша» - массовая советская боевая машина реактивной артиллерии. ",
         "В Нижегородском кремле располагаются интересные исторические здания конца XVII века. Например, по проекту архитектора Я.А.Ананьина и его ученика Б.Растрелли был возведён корпус №92 в 1785 году. Сейчас же здесь расположены Законодательное собрание Нижегородской области, дом советов, офисы Администрации Нижегородской области и т.д. В здании 22 мая 1887 года родился летчик П.Н.Нестеров, который первый совершил форму высшего пилотажа «мертвую петлю» и был автором первого в мире воздушного тарана. ",
         "Пройдя дальше, мы увидели памятник князю Юрию Всеволодовичу и епископу Симону Суздальскому. Памятник был установлен в честь основателя Нижнего Новгорода князя Юрия Всеволодовича и его наставника Симона Суздальского. Открытие памятника состоялось 27 февраля 2008 года. Памятник был поставлен рядом с местом, где стояла деревянная церковь архистратига Михаила. Юрий Долгорукий был первым основателем города, причисленным к лику святых. ",
         "Далее мы поехали вдоль кремлёвской стены и перед нами предстала панорама окрестностей города. Здесь можно увидеть великую реку Волгу, многоэтажные дома и церковь Святого пророка Илии, построенную в 1655 году. ",
         "Во все времена кремль оставался культурным и духовным центром Нижнего Новгорода. Кремль является исторической памятью города, которая объединяет целые эпохи и поколения.",
         "Павлов Даниил"],
     "kremlin_nn.jpg", ""],

    ["Нижний Новгород",
     "В нижегородской школе № 186 уже три года реализуется проект “наследие”. Цель проекта - создать виртуальное и реальное пространство для изучения народных промыслов. На третьем этаже школы развернулся музей со стендами.",
     [
         "В нижегородской школе № 186 уже три года реализуется проект “наследие”. Цель проекта - создать виртуальное и реальное пространство для изучения народных промыслов. На третьем этаже школы развернулся музей со стендами. Рядом с каждым экспонатом находится QR код, по которому можно узнать всю информацию об изделиях народных промыслов. Также в 2019 году на региональном уровне у правительства возникла подобная идея. Город Нижний Новгород стал столицей художественных промыслов России.",
         "4 года назад состоялся первый проект: из всего города в школу приехали мастера шитья, металлообработки, чеканки монет, ткачества. Ребята участвовали в мастер-классах, и некоторые их работы находятся в музее. ",
         "Ученики десятых классов создавали проекты по изучению Нижнего Новгорода. Так ученики 10 класса исследовали тур проекты Нижнего Новгорода. После изучения познакомили ребят и их родителей с родным городом. Валерия Ждановна создала настольные игры о народных промыслах и о городе Нижний Новгород, которые дают новые знания о родине и развивают интеллект. Одна из учениц 10 класса создала путеводитель промыслов по городу, по которому можно определить местоположение народных промыслов с указанием времени пути до них. Мария Аксёнова разработала путеводитель по школе на английском языке для приезжих гостей из-за рубежа.",
         "Посмотрев на проекты ребята из Нижнего Новгорода, мы постараемся также ознакомить учеников нашей школы с родным городом, с народом и народными традициями. Эти проекты дали много идей для преобразования нашей школы.",
         "Колесова Яна"],
     "186_poject.jpg", ""],

    ["Нижний Новгород",
     "Начнём с того, откуда наша команда вообще узнала про эти промыслы. После экскурсии по зданию “НААШ” (об этой прекрасной школе вы можете почитать здесь (ссылка на статью)), мы посетили школьный музей нижегородских ремесел. Экскурсоводы встретили нас, конечно, не хлебом и солью, но зато в национальных русских костюмах.",
     ["Промыслы Нижегородской области (их больше чем вы думаете!)",
      "Начнём с того, откуда наша команда вообще узнала про эти промыслы. После экскурсии по зданию “НААШ” (об этой прекрасной школе вы можете почитать здесь (ссылка на статью)), мы посетили школьный музей нижегородских ремесел.",
      "Экскурсоводы встретили нас, конечно, не хлебом и солью, но зато в национальных русских костюмах.",
      "(фотография)",
      "Мы начали с самого известного. Неповторимая, уникальная и единственная, видя её, понимаешь, вот он русский дух! ",
      "Хохломская роспись",
      "(фото стеллажа из музея) ",
      "Зародился этот стиль в XVII веке... не в деревне Хохлома! На самом деле роспись пошла из нескольких деревень: Больших и Малых Безделей, Шабашей, Мокушино, Глибино и Хрящей. Хохлома была крупным местом своза и продажи уже готовых изделий, отсюда и название. ",
      "Все мы хоть раз видели ложки, тарелки, табуретки и прочие вещи, расписанные в этой технике, но задумывались ли вы, откуда на них этот фирменный золотой блеск? Один из экскурсоводов поведал нам весь технический процесс создания. ",
      "(цитата про изготовление) ",
      "На этом моменте, мы закончили с хохломской росписью и перешли на городецкую. Да, их несколько видов! ",
      "Городецкая роспись ",
      "(фото с городецкой росписью) ",
      "Менее известная, но не менее красивая! ",
      "Зародилась в XIX веке, в Городецком районе Нижегородской области. Берет она начало на городецких прялках, мастера превращали эти обычные ручные прялки в настоящие произведения искусства. ",
      "А чем отличается городецкая роспись от хохломской? Здесь на помощь снова пришли хозяева-экскурсоводы:",
      "(цитата про различия) ",
      "Борнуковская резьба ",
      "(полка в НААШ) ",
      "Чего только не делают в краю Нижегородском! На это есть веские причины, как нам рассказали, почва в области не самая богатая и плодородная, а жить на что-то да надо. Вот и пошли промыслы. ",
      "Борнуковская резьба по камню - ремесло не самое известное, однако обсудить его стоит. ",
      "Мастера по традиции используют объемную резьбу. Вообще, камень из Борнукова продавали и для дворцов царской семьи, но и обычные ремесленники вытворяли различные изделия. Люди, животные, канцелярия, светильники, все было популярно, однако именно анималистическое направление стало традиционным. Лисы, медведи, кошки, собаки, совы, коровы - борнуковские мастера изображали всех, кто был рядом. ",
      "(фото из сувенирной лавки) ",
      "Эти фигурки мы нашли и в туристическом центре на территории Нижегородского Кремля ",
      "Варнавинская резьба",
      "(фото стенда) ",
      "Здесь резьба не по камню, а по кости. Ремесло зародилось ещё в XVIII веке, умельцы украшали рукояти ножей резными узорами, воинами и животными: львами, драконами, птицами. ",
      "Варнавинскую резьбу возродили в XX веке, открыли школу резьбы, позже организовали фабрику. В 80-х промысел стандартизировали, утвердили мотив, который помог обособить его. Изгибающаяся ветка, похожая на хохломскую - особенность этого стиля резьбы. Сейчас ассортимент изделий с варнавинской резьбой огромен. Можно приобрести ларцы и шкатулки, шахматы, письменные принадлежности, гребни, бусы, броши и заколки, в общем, всё что душа пожелает.",
      "Казаковская филигрань (скань)",
      "(фото стеллажа)",
      "Эти изделия можно рассматривать бесконечно. Филигранный промысел в России ещё с IX века, а в селе Казаково с 1938 года. Сформировался он на основе существовавшего там издавна металлообрабатывающего промысла. К 50-м у казаковской скани появились свои отличительные черты, узоры ажурные, с преобладанием растительных мотивов. Чаще всего, изделия белого цвета, на свету они выглядят как снежинки, или покрытые инеем ветки деревьев.",
      "Фух, вроде бы и все! По крайней мере, это были промыслы, о которых нам рассказали в “НААШ”. Их, конечно же, больше, и металлообработка, и другие виды росписи, и золотая вышивка канителью (той самой, от которой пошёл фразеологизм), и многие, многие другие.",
      "Павлов Роман"],
     "thread.jpg", ""],

    ["Поездка",
     "Едва прокукарекали наши будильники, как нам пришлось вскочить с постели, по-армейски быстро одеться и в 5-55 стоять возле большого уютного автобуса, на пузатом боку которого красовалась надпись: «Семейный чемодан». Если вы думаете, что, усевшись на места, мы решили досмотреть утренние сны, то глубоко ошибаетесь. Экскурсовод с необычным именем Ираида Иларьевна прочитала нам целую лекцию по истории Чувашии (ха-ха, уроки решили прогулять – не тут-то было!).",
     [
         "Едва прокукарекали наши будильники, как нам пришлось вскочить с постели, по-армейски быстро одеться и в 5-55 стоять возле большого уютного автобуса, на пузатом боку которого красовалась надпись: «Семейный чемодан».",
         "Если вы думаете, что, усевшись на места, мы решили досмотреть утренние сны, то глубоко ошибаетесь. Экскурсовод с необычным именем Ираида Иларьевна прочитала нам целую лекцию по истории Чувашии (ха-ха, уроки решили прогулять – не тут-то было!). Она тормошила нас вопросами, сулила призы за предстоящую викторину. Мы стойко держались. Особенно Даша Никитина, знавшая ответы практически на все вопросы. Но природа взяла своё: кое-кто уснул богатырским сном.",
         "Кто-то спал, кто-то читал,",
         "Кто-то мамины запасы поедал,",
         "Кто-то на вопросы отвечал…",
         "За окном мелькали тронутые осенним золотом берёзки и осинки, неказистые домики, придорожные кафешки. Автобус всё дальше уносил нас от дома.",
         "И вот экскурсовод объявляет: «Мы покидаем пределы Чувашии». Прилипаем к окнам: нет, никакой границы нет. Те же берёзки, те же осинки… Только на полосатых столбиках появляются новые названия посёлков: Анатольевка, Варганы, Кременки, Крестьянка, Трофимово, Чернуха, Студенец, Михальчиково…",
         "Эх, дороги… Серыми лентами обмотали вы всю землю, соединяя города и посёлки…",
         ""],
     "abobus.jpg", ""],

    ["Нижний Новгород",
     "Церковь была построена в 1719 году. Она была построена промышленником Григорием Строгановым. Родился он в 1656 году, в своей семье был единственным наследником.",
     ["Рождественская церковь Нижний Новгород.",
      "Церковь была построена в 1719 году. Она была построена промышленником Григорием Строгановым. Родился он в 1656 году, в своей семье был единственным наследником. Учился он дома и получил хорошее образование. После того, как он стал единственным наследником их родовых земель. Григорий Дмитриевич получил, большое состояние: огромные территории земель и мощнейшие ресурсы. Строгонов был достаточно богат, чтобы построить такую наикрасивейшую церковь не только в Нижним Новгороде, но и по всей России.",
      " Стиль Рождественской церкви был назван в честь Григория Строгонова «Строгановское барокко». После строительства церкви начали появляться легенды. К сожалению, Строганову не удалось узнать об окончании строительства церкви. Он скончался в 1715 году.",
      "Со дня строительства церкви прошло всего три года. А по приезде Петра1 в Нижний Новгород она была закрыта в 1722. Из зафиксированных записей архиепископом Макарием «Памятники церковных древностей» Петр1 увидел иконы в церкви, написанные придворным мастером Караваком для Петропавловского собора. До самой смерти Петра1 в Строгановской церкви не проводились богослужения.",
      "В 1727 церковь всё-таки снова была открыта для прихожан.",
      "Бывало, что церковь и горела, но она всё равно восставала в своём шикарном и потрясающем облике.",
      "В советское время было решение об уничтожении Строгановской церкви. Но храм был спасён отцом Сергием, собравшим материалы его истории и архитектуры. ",
      "Известные часы, которые висят на церкви, имеют свою интересную историю. Часы показывали и время, и  положение светил.  Однажды так случилось, что часы остановились, и никто не мог их починить. И как-то раз на колокольню забрался мальчик и починил часы. Это был Иван Кулибин, он в детстве жил недалеко от церкви. ",
      "Вот так и прославился Кулибин и стал изысканным мастером и дал славу Нижнему Новгороду. Появилась легенда о том, что часы вновь остановились после смерти Ивана.",
      "Семенова Настя"],
     "church.jpg", ""],

    ["Нижний Новгород",
     "Город Нижний Новгород удивляет не только своей незыблемой историей, многогранной культурой, но и невообразимыми пейзажами. Существует множество удивительных мест, в которых можно полностью насладиться природой большого и великого города. Одни из них –смотровые площадки",
     [
         "Город Нижний Новгород удивляет не только своей незыблемой историей, многогранной культурой, но и невообразимыми пейзажами. Существует множество удивительных мест, в которых можно полностью насладиться природой большого и великого города. Одни из них –смотровые площадки.",
         "- В самом центре города находится Аллея любви, здесь же располагается смотровая площадка у Кремля. Аллея имеет протяженность около 4 километров и начинается от площади Минина и Пожарского и заканчивается у Северной башни. Со смотровой площадки можно увидеть слияние двух рек Оки и Волги. Их воды разного цвета, какое-то расстояние они текут, не смешиваясь, образуя «стрелку».",
         "- Вторая смотровая площадка находится около памятника Валерию Чкалову на Чкаловской лестнице. Лестница соединяет две набережные: Верхнюю и Нижнюю Волжскую и является самой длинной мемориальной лестницей в стране, имеет 560 ступенек. Строительством лестницы занималось 3 архитектора: Лев Руднев, Владимир Мунц, Александр Яковлев. С площадки открывается великолепная панорама города. ",
         "- Заключительной смотровой площадкой в нашей поездке стала Набережная Федоровского. Она является верхней набережной Оки. Набережную можно назвать одним из любимых мест жителей и туристов города, она обустроена всеми современными технологиями для удобства. Есть уютные лужайки, на которых можно устроить пикник, на набережной можно прогуляться и около памятников Жюлю Верну и Максиму Горькому, также тут находится и здание Ломоносовского училища. Набережная была названа в честь доктора геолого-минералогических наук – Николая Михайловича Фёдоровского. Со смотровой площадки открывается живописный вид на город и на православный храм Александра Невского. «Город на ладони» - именно это приходит на ум при посещение набережной Фёдоровского.",
         "Борисова Кристина"],
     "obser_decks.jpg", ""],

    ["Нижний Новгород",
     "29 сентября наша делегация отправилась знакомиться с достопримечательностями Нижнего Новгорода. В ходе этой экскурсии мы узнали об известном советском лётчике, уроженце Нижнего Новгорода, Валерии Чкалове. Он совершил первый беспосадочный перелёт через северный полюс из Москвы в Америку. ",
     [
         "29 сентября наша делегация отправилась знакомиться с достопримечательностями Нижнего Новгорода. В ходе этой экскурсии мы узнали об известном советском лётчике, уроженце Нижнего Новгорода, Валерии Чкалове. Он совершил первый беспосадочный перелёт через северный полюс из Москвы в Америку. В его честь 15 декабря 1940 года был воздвигнут памятник на Верхневолжской набережной, на которой он любил прогуливаться, когда был в родном городе. ",
         "Интересно, что изначально на этом месте, которое выбрал сам Чкалов, должен был располагаться памятник Максиму Горькому, но после смерти лётчика в результате неудачного испытания самолёта, А. Менделеевич выступил автором скульптуры друга. От этого памятника отходит Чкаловская лестница, которая раньше называлась Сталинградская, а позже Волжская, но всё же  больше прижилось народное название в честь лётчика. ",
         "Лестница соединяет Верхневолжскую и Нижневолжскую набережные. Главной причиной постройки этой лестницы являлось создание кратчайшего пути из самого сердца старого города к Волге. Строительство лестницы откладывалось из-за невозможности воплотить идеи Александра Шульпина в преддверии Отечественной войны, но в 1943 он всё же получил разрешение. ",
         "Авторами сооружения являются трое победителей конкурса на проект Сталинградской лестницы Лев Руднев, Владимир Мунц и Александр Яковлев, который выступил инженером проекта и также взялся за решение проблем оползней, которые в начале 40-х годов разрушали Волжский откос. ",
         "Лестницу строили в течение 5 лет до 1949 года. В постройке участвовали жители Горького и немецкие военнопленные. На строительство лестницы ушло около 8 миллионов рублей, что являлось огромной на то время суммой, из-за чего Шульпина обвинили в растрате. ",
         "Лестница имеет 560 ступеней, если считать обе стороны “восьмёрки” и 442, если считать только по правой стороне. В 1985 году в самом низу лестницы был установлен катер “герой”. Судно, которое участвовало в Гражданской и Отечественной войнах. Является финальной частью лестницы. ",
         "На сегодняшний день Чкаловская лестница является одним из самых знаковых символов Нижнего Новгорода. Мы смогли во всей полноте прочувствовать колорит и историю этого места, находясь там и слушая увлечённый рассказ нашего экскурсовода, коренного жителя Нижнего Новгорода.",
         "Афанасьева Дарья"],
     "ladder.jpg", ""],

    ["Нижний Новгород",
     "В интервью добровольно приняли участие несколько ребят, и вот что они говорят о родной школе. Аня, ученица старшей школы, отметила следующее: 1. Современный интерьер школы и общая атмосфера учебного заведения добавляют мотивации ученикам больше стремиться к знаниям и настраивают на нужный лад; ",
     ["Школа НААШ со слов учащихся. ",
      "В интервью добровольно приняли участие несколько ребят, и вот что они говорят о родной школе. ",
      "Аня, ученица старшей школы, отметила следующее: ",
      "1. Современный интерьер школы и общая атмосфера учебного заведения добавляют мотивации ученикам больше стремиться к знаниям и настраивают на нужный лад;",
      "2. Явным минусом ученица отметила  коммерческую сторону школы, что за каждое внеурочное задание нужна отдельная плата, а это отличается от большинства других школ. ",
      "Глеб и Даша, ученики 9 класса, гуманитарии и планируют сдавать обществознание. Они поделились своим мнением о школе, выделив солидарность среди учителей и обучаемых. Со слов ребят: “В учебном коллективе всегда присутствует уважение и взаимопомощь, каждый уважает личные границы и мнение друг друга. Солидарность - очень важна в наше время, особенно в стенах учебного учреждения”.",
      "Михайлова Алиса"],
     "school_naash.jpg", ""],

    ["Нижний Новгород",
     "Несколько дней назад учащимся среднего и старшего звена нашей школы посчастливилось принять участие в занимательном проекте “ЭТНО-Хакатон”, в рамках которого ученики побывали в Нижегородской Авторской Академической Школе №186. Целью проекта стало изучение культурных традиций народов России. Наша группа вооружилась всей необходимой фото- и видеотехникой и начала своё путешествие.",
     [
         "Несколько дней назад учащимся среднего и старшего звена нашей школы посчастливилось принять участие в занимательном проекте “ЭТНО-Хакатон”, в рамках которого ученики побывали в Нижегородской Авторской Академической Школе №186. Целью проекта стало изучение культурных традиций народов России. Наша группа вооружилась всей необходимой фото- и видеотехникой и начала своё путешествие.",
         "В школе учеников встретили очень радушно и доброжелательно. Нас познакомили с внутренним устройством школы, провели увлекательную экскурсию, в ходе которой показали нам классы, в которых проходит образовательный процесс. Своими глазами мы увидели спортивный зал для занятий физкультурой, бассейн, в котором ученики школы №186 осваивают плавание, а также участвуют в спортивных соревнованиях по данному виду спорта. Также нашей группе особенно запомнились кабинет информатики и библиотеки, оснащённые по последнему слову техники, предназначенной для освоения учениками учебной программы. Мы сравнивали классы нижегородской школы с классами нашей родной школы, отмечали интересные детали и беседовали о том, чтобы нам хотелось видеть в оснащении и устройстве классов в нашем учебном заведении.",
         "Атмосфера в школе в урочное время показалась нам очень мягкой и дружелюбной. Учителя вежливо относятся к ученикам и получают такое же отношение от детей в ответ. Они ведут своих подопечных к высокому уровню знаний целенаправленно и в то же время очень мягко и внимательно.",
         "Отдельное внимание мы уделили переменам. Во время перерывов между уроками в коридорах и классах царит настоящее веселье. Нами было отмечено, что в школе нет определённого дресс-кода и ученики одеты в свободную форму, что создаёт некоторое разнообразие в самовыражении учащихся. На переменах все сбрасывают напряжение, развлекаются и занимаются интересными делами, отдыхая от изучения различных важных дисциплин.",
         "После нашего путешествия мы обсуждали свои впечатления и пришли к выводу, что такая поездка была для нас очень полезна, так как мы посчитали, что такой опыт для нас крайне полезен. Некоторые ребята из нашей группы стали задумываться о том, чтобы в будущем стать учителями, многие предлагали свои идеи для усовершенствования школ на основе увиденного нами в школе №186 г. Нижний Новгород. Во время поездки мы много фиксировали на нашу технику и уверены, что проект получится замечательным.",
         "Андреева Юлия"],
     "school.jpg", ""],

    ["Нижний Новгород",
     "Попав в данное учреждение, в глаза сразу бросаются лица счастливых детей. Атмосфера школы представляется нам как уютная и веселая. При входе впечатление складывается, что их эмблема в точности олицетворяют их. ",
     [
         "Попав в данное учреждение, в глаза сразу бросаются лица счастливых детей. Атмосфера школы представляется нам как уютная и веселая. При входе впечатление складывается, что их эмблема в точности олицетворяют их. Для свободного времяпровождения от уроков в коридоре организованы специальные места, где дети могут беззаботно и без травм, не теряя при этом интерес к учебе, провести свой небольшой промежуток времени между уроков. ",
         "Небольшие мягкие маты и кубы, из которых можно построить то,  что хочешь, тем самым развивая креативность и не теряя времени, отдав его бездельному время провождения в телефонах, дают разнообразия в школьные будни. ",
         "Так же на стенах коридора отмечена история школы и у самого входа были показаны достижения данной школы, уже доказывая свою активность и то, как ученики прогрессируют своим стараниям, выводя свою школу в список достойных. ",
         "Разные секции и виды спорта, как скалолазание, так же дают школьникам  ввести в серые будни то движение, которое, так необходимо любому ребёнку в самовыражение себя и ярких эмоций.  И даже если ребёнок менее активный, то в этом прекрасном учреждении представлена ещё одно красивое и не менее важное место - библиотека, находящаяся на первом этаже в огромном зале, которую в любой момент можно посетить. ",
         "Также отметим то, что в школе есть свой открытый музей, посвящённый ремеслу этого города, и это показывает, как они ценят свою историю и стараются продвигать, передавая новому поколению интерес к этому.",
         "Николаева Валентина"],
     "school_2.jpg", ""],

    ["Казань",
     "Татарстан — многонациональный регион с приветливыми жителями. Это земля с тысячелетней историей, богатая природными ресурсами и обладающая уникальным культурным наследием. Как и во всех национальностях мира, у татар есть своя культура. Это танцы, песни, кухня, национальные костюмы и многое другое. ",
     [
         "Татарстан — многонациональный регион с приветливыми жителями. Это земля с тысячелетней историей, богатая природными ресурсами и обладающая уникальным культурным наследием. Как и во всех национальностях мира, у татар есть своя культура. Это танцы, песни, кухня, национальные костюмы и многое другое.",
         " Ученики школы №61 города Чебоксары отправились в столицу республики Казань, чтобы больше узнать и увидеть собственными глазами культурную часть города. По приезде в город, ученики посетили многопрофильную школу № 181. Там их тепло встретили учащиеся, одетые в татарские национальные костюмы, а также директор школы Абдулина Дина Альбертовна. После небольшого приветствия, специально для туристов был проведен концерт, одним из номеров которого был танец «Дружба народов», которым хотели показать, насколько танцевальная культура народов разнообразна. Танцующие были одеты в национальные костюмы разных народов, и каждая пара представляла ту или иную национальность. Данное выступление оставило прекрасное впечатление и осталось в сердцах гостей надолго. В ходе интервью у одной из учениц, оказалось, что данное выступление ежегодно проходит в стенах этой школы во время фестиваля, когда каждый класс представляет свою (выбранную жеребьевкой) страну. ",
         " Также после выступления, на одном из мастер-классов по изготовлению калфаков, преподаватели разговаривали на татарском языке. Туристам особенно интересно было слушать татарскую речь, так как данный язык распространен среди чувашей, марийцев, башкир и некоторых других народов России, более того имеет много общего с чувашским языком. ",
         " Музыка татар – часть духовной культуры народа – тесно связана с традициями, историческими отношениями с другими народами, поэтому она является важным источником исторической информации. На народные песни оказали влияние поэзия, верования, обряды, языковые особенности. Татарские народные песни разделяются на лирические и эпические. Лирические песни считаются у татар самой традиционной и популярной частью народно-песенного наследия.",
         "Голубева Валерия"],
     "school_kazan.jpg", ""
     ],

    ["Казань",
     "26 октября команда 61 школы посетила Казань. Одной из точек в их маршрутном листе была мечеть Кул Шариф. Мечеть была открыта 24 июня 2005 году, к 1000-летнему юбилею Казани. ",
     ["26 октября команда 61 школы посетила Казань. Одной из точек в их маршрутном листе была мечеть Кул Шариф. ",
      "Мечеть была открыта 24 июня 2005 году, к 1000-летнему юбилею Казани. Это был один из самых крупных объектов, построенных к празднику. ",
      "Архитектура здания поражает своей красотой. Её купол,окрашенный в цвет неба, напоминает шапку-корону, которые раньше носили казанские ханы.",
      "Заходя в мечеть, первое, что бросается в глаза - макет. Это макет мечети Кул Шариф. Он подсвечивается маленькими прожекторами и расположен на крутящийся подставке. Если пройти вперёд, то вы увидите мозаику, смотря на неё, люди молятся.",
      "Пройдя на самый верхний этаж здания, можно увидеть очень красивую люстру, которая висит под куполом. Её изготовили из цветного стекла и хрусталя по эскизам татарских художников в Чехии. Также все осветительные приборы были изготовлены там.",
      "Интересным фактом является то, что мечеть имеет 5 этажей, включая цокольный и технический. На первом расположен молельный зал для мужчин и кабинет имама, на втором - молельный зал для женщин и смотровая площадка в виде балконов для туристов. На цокольном расположились гардеробы, музей ислама и зал для омовения. ",
      "Также стоит отметить, что в Кул Шариф чтение корана происходит круглосуточно.",
      "Посещение этого места стало очень значимым для ребят. Они узнали много нового и восхитились красотой мечети.",
      "Шарова Карина"],
     "mechet.jpg", ""
     ],

    ["Казань",
     "Под конец поездки в Казань наша делегация держала путь мимо озера Кабан. Вечерние огни города завораживающей красотой отображались на водной глади озера и экскурсовод, поддержав атмосферу, поведала нам несколько существующих мнений (легенд) про его название и не только. Первое гласит, что когда-то дикие свиньи  - кабаны обитали в камышах, растущих по берегам озера.",
     [
         "Под конец поездки в Казань наша делегация держала путь мимо озера Кабан. Вечерние огни города завораживающей красотой отображались на водной глади озера и экскурсовод, поддержав атмосферу, поведала нам несколько существующих мнений (легенд) про его название и не только. ",
         "Первое гласит, что когда-то дикие свиньи  - кабаны обитали в камышах, растущих по берегам озера. К началу 19 века этих кабанов полностью истребили, но название так и осталось.",
         "Вторая легенда гласит о булгарском князе Кабанбеке, который спасаясь от преследования среднеазиатского завоевателя Тамерлана, бежал на север из разграбленного и перебитого города Болгар. Проходя через леса и болота, он вышел на берег большого чистого озера, чьи воды оказались лечебными и излечили князя. Так он и остался жить на берегу того озера, где вскоре образовалось поселение. ",
         "Также нам рассказали интересную легенду о сокровищах озера Кабан. По преданию, когда войско Ивана Грозного осаждало город в 1552 году, казанские ханы бросали в воду свои невообразимые богатства , дабы те не достались царю. Сокровища и по сей день вызывают интерес и споры. И чтобы удостовериться в правдивости наличия богатств на дне озера, не раз проводились попытки достать клад, что не удавалось из-за глубокого слоя ила, около 2-3 метров. ",
         "Виды и история озера дополнили бушующие эмоции от поездки в Казань и, я думаю, что надолго запечатлятся в нашей памяти.",
         "Афанасьева Дарья"],
     "kaban.jpg", ""
     ],

    ["Казань",
     "Наша дружная группа вновь отправилась в экспедицию, чтобы с головой окунуться в проект ЭТНО-хакатон. На этот раз мы прибыли в Казань – столицу Татарстана. Микрорайон, где мы высадились из автобуса, называется «Седьмое небо».",
     ["Поездка в Казань (путевые заметки)",
      "Наша дружная группа вновь отправилась в экспедицию, чтобы с головой окунуться в проект ЭТНО-хакатон. На этот раз мы прибыли в Казань – столицу Татарстана. ",
      "Микрорайон, где мы высадились из автобуса, называется «Седьмое небо». Наверное, потому, что вокруг стоят небоскрёбы. А в центре жилого массива – многопрофильная школа № 123. Нас гостеприимно встречают директор, учителя, дети, одетые в национальные костюмы. Школа уютная, красиво оформленная, глаза разбегаются. Но первое знакомство всё же виртуальное: в актовом зале мы смотрим видео-экскурсию по школе. Через несколько минут мы отправимся по коридорам и мастерским. А пока нас просто захватывает танец «Дружба народов». Мелодии сменяют друг друга, девушки в национальных костюмах народов Поволжья парами выходят вперед и исполняют знакомые движения. Как радостно застучало сердце, когда мы узнали родной чувашский мотив!",
      "Мы хотим узнать, как живут наши сверстники в соседних регионах, поэтому с любопытством расспрашиваем старшеклассниц, участвуем в необычном уроке ОБЖ прямо в коридоре, где на стенах висят интерактивные доски с заданиями.",
      "Потом мы весело выкладываем собственные имена на русском и английском языках с помощью…матрёшек. Такая уникальная азбука – ручная работа ребят и педагогов. К ручному труду в казанской школе, как мы заметили, особо трепетное отношение. Нас в два счёта научили изготавливать  татарский женский головной убор калфак, делать деревянные значки с эмблемой школы, рисовать главный элемент татарского орнамента – тюльпан. Словом, мастер-классы обогатили нас и духовно, и физически, ведь мы унесли на память сделанные собственными руками сувениры.",
      "Мы даже отведали, чем кормят ребят в школьной столовой. Еда была отличной, но всё же мы единодушно решили, что в своей родной школе блюда привычнее и вкуснее.",
      "Экскурсия по городу восхитила по-настоящему. Интересно было узнать историю Казанского кремля, зайти внутрь мечети Кул-шариф, услышать чтение Корана (а оно здесь происходит круглосуточно), увидеть наклоненную башню Сююм-беке. Рассказ экскурсовода включал в себя исторические факты и таинственные легенды, поэтому слушать было нисколько не утомительно. Со смотровой площадки мы увидели Казань как на ладони. ",
      "Под конец прогулки наша делегация держала путь мимо озера Кабан. Вечерние огни города завораживающей красотой отображались на водной глади озера. В такой таинственной атмосфере мы и услышали от экскурсовода легенды. ",
      "Первая гласит, что когда-то дикие свиньи – кабаны – обитали в камышах, растущих по берегам озера. К началу 19 века этих кабанов полностью истребили, но название так и осталось.",
      "Вторая легенда гласит о булгарском князе Кабанбеке, который, спасаясь от преследования среднеазиатского завоевателя Тамерлана, бежал на север из разграбленного и перебитого города Болгар. Проходя через леса и болота, он вышел на берег большого чистого озера, чьи воды оказались лечебными и излечили князя. Так он и остался жить на берегу того озера, где вскоре образовалось поселение. ",
      "Также нам рассказали интересную легенду о сокровищах озера Кабан. По преданию, когда войско Ивана Грозного осаждало город в 1552 году, казанские ханы бросали в воду свои невообразимые богатства, дабы те не достались царю. Сокровища и по сей день вызывают интерес и споры. И чтобы удостовериться в правдивости наличия богатств на дне озера, не раз проводились попытки достать клад, что не удавалось из-за глубокого слоя ила, около 2-3 метров. ",
      "Усевшись в автобус, мы долго делились впечатлениями, и в душе рождалась мысль, что в многоликой России есть место для каждого из нас. Мы такие разные, но мы близкие.",
      ""],
     "kazan_1.jpg", ""
     ],

    ["Казань",
     "В Республике Татарстан нам также рассказали о символике. Государственный флаг представляет собой полотнище, прямоугольной формы, с тремя горизонтальными полосами. Первой идет полоса зелёного цвета, она означает весеннею зелень, возрождение и молодость. ",
     [
         "В Республике Татарстан нам также рассказали о символике. Государственный флаг представляет собой полотнище, прямоугольной формы, с тремя горизонтальными полосами. Первой идет полоса зелёного цвета, она означает весеннею зелень, возрождение и молодость. Также, зеленый - цвет религии Ислама, которая является основной на территории Татарстана. В середине проходит тонкая полоска белого цвета. Белый - цвет чистоты, символизирует честь и мир. Последней частью флага является широкая полоса красного цвета, выражая зрелость, силу и жизненную энергию народа. Данные цвета имеют большое влияние в республике. Так, в столице Татарстана - городе Казань, все троллейбусы окрашены в зеленый, автобусы в красный, а такси в белый.",
         "На Государственном гербе изображён крылатый барс с золотым щитом на поясе на фоне красного солнца, он помещен в обрамление из татарского народного орнамента, который расшифровывается, как “Татарстан”. Барс - покровитель народа, круглый щит - правовая, экономическая, силовая защищенность граждан республики. ",
         "Также, татарский народ имеет свои уникальные орнаменты. Самым распространенным является - цветочно-растительный орнамент, его отличительная особенность - асимметрия элементов. Основным его мотивом приходит - тюльпан, он несет в себе смысл возрождения и неразрывно связан с религиозными убеждениями мусульманской веры. Цветок ассоциируется с именем Аллаха.",
         "Киргизова Юля"],
     "flag.jpg", ""
     ],

    ["Казань",
     "Одной из самых красивых достопримечательностей этого места для меня стала - башня Сююмбике. Свою известность она получила из-за наклона на Восток, который появился в результате неправильного строительства. В прошлом веке башня была обнесена железным поясом, чтобы остановить падение.",
     ["Невозможно посетить Казань и не побывать в одном из самых красивых мест города - Казанском Кремле.",
      "Одной из самых красивых достопримечательностей этого места для меня стала - башня Сююмбике. Свою известность она получила из-за наклона на Восток, который появился в результате неправильного строительства. В прошлом веке башня была обнесена железным поясом, чтобы остановить падение. На данный момент за этим следит современное оборудование. До 19 века башня являлась дозорной вышкой, а теперь одна из главных достопримечательностей города.",
      "Как нам рассказала экскурсовод: <<История башни оставляет много загадок. До сих пор неизвестны дата постройки и почему она получила именно это название. Документы о её строительстве были утеряны>>. Конечно, как древнее и очень красивое место, оно обросло легендами. Одна из них получила во мне яркий отклик. <<Иван Грозный, прослышав о красоте царицы Казанской, направил в Казань сватов, предложив ей стать его женой и царицей Московского государства. Сююмбике не хотела покидать родину и отказалась. Тогда разгневанный царь со своим войском подошел к Казани, пообещав стереть город с лица земли. Сююмбике испугалась за свой народ и приняла предложение Ивана Грозного, попросив у него необычный свадебный подарок — самую высокую в Казани башню, построенную за семь дней. Так за неделю была возведена 58-метровая башня — каждый день она вырастала на один ярус. Ничего не оставалось Сююмбике, кроме как согласиться на замужество. Перед свадьбой попросилась она подняться на башню, чтобы осмотреть напоследок любимый город. И поняла, что не может покинуть родину. Сююмбике расплакалась и бросилась вниз. В память о доброй царице башню назвали ее именем.",
      "Остаться равнодушным здесь невозможно. Величие башни Сююмбике, её грандиозность захватывают дух и вызывают восхищение.",
      "Алексеева Арина"],
     "tower.jpg", ""
     ]]


DBN = DB_new()
DBN.create_all_tables()
DBN.create_new_article("Нижний Новгород", "/nizhny")
DBN.create_new_article("Казань", "/kazan")
DBN.create_new_article("Поездка", "/trip")
for i in card_information:
    if i[0] == "Казань":
        root = '/kazan'
    elif i[0] == 'Нижний Новгород':
        root = '/nizhny'
    elif i[0] == "Поездка":
        root = '/trip'
    introduce = i[1]
    text = ''.join(i[2][:len(i[2]) - 1])
    name = i[2][len(i[2]) - 1]
    image = '/img/' + i[3]
    DBN.add_new_card_to_article(
        root,  # "/nizhny"
        introduce,  # "Hi"
        text,
        image,
        "",
        "simple-card",
        name
    )