LONGRID = [
    ["Саранск", "Первое впечатление", ["Путешествие в Саранск было очень утомительным, но весьма интересным. Наша команда добиралась до него почти 7 часов, оказавшись там, впечатлилась красотой города. Саранск умело сочетает в себе современную и старинную архитектуры. Большое количество памятников и музеев, сувенирные лавки, добрые люди и интересная история города - всё это заставило влюбиться в столицу Мордовии. Саранск сразу же удивил нас своими табличками, на которых названия улиц написаны на четырех языках: русском, английском, мокшанском и эрзянском. Разгадать эту загадку помогла экскурсовод Светлана: «Мокши и эрзя чувствуют себя братскими народами, хотя отличий между ними довольно много. Они говорят на разных диалектах, без знания языка не понимают друг друга. Мокши расселены на западных и южных территориях республики, а эрзя на севере и востоке»." , ""], "СтадионСК.jpg", "", 0],
    ["Саранск", "Экскурсия по городу!памятники", ["Отправной точкой нашего путешествия по городу стал памятник адмирала Ф.Ушакова, расположенный в центре Соборной площади. Федор Федорович Ушаков (1745–1817) - адмирал, не знавший ни одного поражения. Его имя связано с Мордовией тем, что последние годы своей жизни он провёл на мордовской земле в имении Алексеевке." , ""], "УшаковСК.jpg", "", 0],
    ["Саранск", "Экскурсия по городу!памятники", ["Прогуливаясь по центру города, наша команда увидела бронзовый “Памятник семье”. Считается, если потереть живот матери, у вас хорошо сложится семейная жизнь." , ""], "Семья.jpg", "", 0],
    ["Саранск", "Экскурсия по городу!памятники", ["Под конец нашего пребывания, мы посетили лисий мостик, исполняющий людские желания. Такое название он носит из-за скульптуры лисы - символа Саранска. Даже градообразующее предприятие называется «Лисма». Если потрёшь хвостик и мордочку хозяйки мостика, то обретёшь удачу и богатство. Однако в этом месте можно погадать на судьбу при помощи “шаров предсказаний”. На одном из них указаны сферы жизни - работа, любовь, семья и т.д, а на другом - действия. Лисий мост (смог одарить невероятно сказочными впечатлениями.) на какое-то время задержал нашу экскурсию." , ""], "Лиса.jpg", "", 0],
    ["Саранск", "Экскурсия по городу!история", ["Во время нашей прогулки экскурсовод рассказывала об истории города. Мы узнали, что официально Саранск стал столицей Мордовии в 1934 году, а название города пошло от реки “Саранка”, протекающей по центральной площади города. Он был основан как военная крепость Саранеск в 1641. Также нам рассказали, что 70% населения здесь составляют русские, порядка 20% — мордва." , ""], "",  "", 0],
    ["Саранск", "Экскурсия по городу!символы", ["Один из главных символов республики - финно-угорская красная восьмиконечная звезда - символ солнца и тепла. Мы узнали о современном флаге, состоящем из трёх горизонтальных полосок. Первая полоса темно красного цвета, символизирующая силу, мужество и храбрость. В середине полоса белого цвета - символ чистоты намерений народа. Третья полоса тёмно-синего цвета означает свободу и верность. Восьмиугольная розетка украшает флаг республики и обозначает благополучие, добро, открытость и теплоту." , ""], "ФлагСК.jpg", "", 0],
    ["Саранск", "Экскурсия по городу!архитектура", ["Мы узнали, что Саранск – это студенческий город, здесь живут более 20 тысяч студентов, то есть каждый десятый житель обучается в вузах. А самый большой из них – семнадцатиэтажный МГУ. Но не путайте с московским университетом! Мордовский государственный университет носит имя Александра Огарёва, уроженца этих мест. Стиль этого здания нельзя назвать современным, хочется отнести его к викторианскому." , ""], "МГУСК.jpg", "", 0],
    ["Саранск", "Экскурсия по городу!архитектура", ["Что не скажешь о «Мордовия Арена» — футбольном стадионе в Саранске. Это здание выполнено в стиле модернизма. Оно очень яркое, напоминает  красное солнце на флаге Мордовии." , ""], "СтадионСК.jpg", "", 0],
    ["Саранск", "Экскурсия по городу!архитектура", ["Большое впечатление произвела на нас площадь Победы. Мы постояли у Вечного огня, рядом с которым памятник: мать провожает сына на фронт. Одну руку она прижала к груди, другую положила на огромный меч. «Моё сердце в твоём мече», - высечено на постаменте. Неподалеку Музей боевой славы, стены которого выкрашены в цвета георгиевской ленты, а форма музея повторяет очертания карты Мордовии." , ""], "ПобедаСК.jpg", "", 2],
    ["Саранск", "Знаменитости", ["Наша команда смогла узнать о Величайшем скульпторе. Им был Степан Дмитриевич Эрьзя. Он родился и умер в ноябре, а в этом году отмечается 155 лет с его рождения. Художник смог стать Выдающимся Творцом, освоил материал “железное дерево” и создал более 200 своих “детей”. Именно так он называл свои творения, думая, что в них сокрыта его собственная душа. В “Музее имени С.Д. Эрьзи” мы ознакомились с его работами и узнали историю создания почти каждой." , ""], "ЭРЗ.jpg", "", 0],
    ["Саранск", "карта", ["Наша команда смогла узнать о Величайшем скульпторе. Им был Степан Дмитриевич Эрьзя. Он родился и умер в ноябре, а в этом году отмечается 155 лет с его рождения. Художник смог стать Выдающимся Творцом, освоил материал “железное дерево” и создал более 200 своих “детей”. Именно так он называл свои творения, думая, что в них сокрыта его собственная душа. В “Музее имени С.Д. Эрьзи” мы ознакомились с его работами и узнали историю создания почти каждой." , ""], "ЭРЗ.jpg", "", 0],
    ["Саранск", "Интересные факты", ["В Мордовии мокшанский и эрзянский языки считаются официальными. Они совпадают на 73%, однако мокше и эрзя почти не понимают друг друга. Мокшанский - самый крупный из них, на нем говорят около 228 тысяч человек. Это очень трудный язык, одно слово может иметь более 90 грамматических форм. Раньше в мокшанском языке слово могло начинаться с твердого знака: «ърьвяня» («сноха, невестка»). В настоящее время он не обозначается на письме - слово пишется как «рьвяня». Современный мокшанский и эрзянский алфавит графически совпадает с русским." , ""], "", "", 1],
    ["Саранск", "Национальная одежда", ["В составе мордовского народа выделяют два субэтноса - мордвы-мокши и мордвы-эрзи. И, конечно, их национальные костюмы немного различаются. Но есть и общие черты: белый холст как основной материал, туникообразный покрой рубах, отделка вышивкой, украшения из монет, раковин и бисера." , ""], "КостюмСК.jpg", "", 0]
]


STATES = [
    ["Саранск", "Языки", ["В русском языке, равно как и в эрзянском, глухих эквивалентов сонорных согласных «р», «л» и «й» нет. Различие между глухостью и звонкостью смыслоразличительное: «марь» — «яблоко», «марьть» — «яблоко» в форме родительного падежа определенного склонения (как в словосочетании «кожура яблока»)", "В мокшанском языке распространены стечения согласных, которые нетипичны для многих других языков, в том числе финно-угорских: например, «подогнутый» — мянтьф, «заставить уничтожить» — машфтфтомс. Интонации в мокшанском языке очень характерные: в конце фразы происходит резкое повышение тона, а потом спад и удлинение звука, на который приходится последний интонационный акцент. Благодаря этому речь звучит протяжно и распевно." , "Павлов Роман"], "", ""],
    ["Саранск", "Национальные блюда", ["Раньше мордовцы ели толстые блины, пироги с различной начинкой, пили квас, кислое молоко и берёзовый сок. Традиционной едой считается селянка(солянка по-мордовски)" , ""], "СелСК.jpg", ""],
    ["Саранск", "Национальные блюда", ["Медвежья лапа" , ""], "ЛапаСК.jpg", ""],
    ["Саранск", "Национальные блюда", ["Ватрушка с картофелем." , ""], "ПирожкиСК.jpg", ""],
    ["Саранск", "Национальные блюда", ["Мордовские блины" , ""], "БЛИН.jpg", ""],
]

from db import DB_new
import pprint
ALL_PARTS = {}
for part in LONGRID:
    # print(part)
    city, header, p, img, link, serial_of_card = part
    header = header.split("!")[-1]
    text, author = p
    
    if "." not in img:
        if img == "карта":
            img = ""
            type = "map"
        else:
            type = "simple-card"
    if header in ALL_PARTS:
        ALL_PARTS[header]["full_text"].append(text)
        ALL_PARTS[header]["author"] = author if ALL_PARTS[header]["author"] == "" else ""
        if img != "":
            ALL_PARTS[header]["img"].append(img)
        ALL_PARTS[header]["card"] = serial_of_card if ALL_PARTS[header]["card"] == 0 else ALL_PARTS[header]["card"]
    else:
        ALL_PARTS[header] = {
            "full_text" : [text],
            "author" : author,
            "img" : [img] if img != "" else [],
            "type" : type,
            "link" : link,
            "card" : serial_of_card
        }

DBN = DB_new()
# DBN.create_all_tables()
rout = "/saransk"
DBN.create_new_article("Саранск", rout, "/img/saransk-gerb.png", "/img/saransk-pre.webp")
for el in ALL_PARTS:
    if len(ALL_PARTS[el]["img"]) <= 3:
        im_1 = []
        for i in range(len(ALL_PARTS[el]["img"])):
            im_1.append(ALL_PARTS[el]["img"])
        type = "simple-card" if ALL_PARTS[el]["type"] not in ["map"] else ALL_PARTS[el]["type"]
    else:
        im_1 = ALL_PARTS[el]["img"]
        type = "karousel"
    id_longrid = DBN.add_new_longrid_part(rout, el, "", el, ALL_PARTS[el]["full_text"], ALL_PARTS[el]["author"], im_1)
    if ALL_PARTS[el]["card"] != 0:
        if "*" in str(ALL_PARTS[el]["card"]):
            pass
        else:
            id_of_card = ALL_PARTS[el]["card"]
            city, header, p, img, link = STATES[id_of_card - 1]
            text, author = p[:-1], p[-1]
            DBN.add_new_card_to_longrid(id_longrid, header, text, img, "", "text", author)
    elif type == "map":
        DBN.add_new_card_to_longrid(id_longrid, header, text, img, "", "map", author)