<template>
  <div>
    <div class="main-block-anounce">
      Проект «Патриотическое воспитание граждан Российской Федерации» национального проекта «Образование»
      <div class="anounce-block">
        В 2021 году школа №61 города Чебоксары стала
победителем конкурса Минпросвещения России в рамках
федерального проекта «Патриотическое воспитание
граждан Российской Федерации» национального проекта
«Образование» и получила грант на реализацию школьного
проекта «Интерактивный парк «ЭТНО-Хакатон».
Проект направлен на популяризацию традиционной
культуры народов Российской Федерации и развитие
цифровых навыков участников проекта.
Цель проекта: создание условий для патриотического
воспитания школьников через изучение культуры и
национальных традиций народов пяти субъектов РФ:
Чувашии, Татарстана, Марий Эл, Мордовии, Нижнего
Новгорода.
Участниками проекта в 2021 году стало более 1000 человек.
Проект продолжается…
      </div>
    </div>
    <hr>
  </div>
</template>

<style lang="scss">
.main-block-anounce {
  margin-top: 7px;
  margin-bottom: 30px;
  font-size: 25px;
  font-family: "Yanone Kaffeesatz", sans-serif;
  text-align: left;
  .anounce-block {
    font-size: 19px;
    font-family: "Caveat", cursive;
  }
}
</style>
